{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Padova Grand Tour - Queries\n",
    "\n",
    "This notebook will provide ten insightful queries about our data. Get started by starting GraphDB with `docker compose up --force-recreate`.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Sparql wrapper (copy and pasted from the Individual Project's notebooks):"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "# Taken from `data/ttlData/ontology.ttl`\n",
    "prefixString = \"\"\"\n",
    "PREFIX ofn: <http://www.ontotext.com/sparql/functions/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#> \n",
    "PREFIX pgt: <https://padovagrandtour.github.io/entitites#> \n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace> \n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> \n",
    "PREFIX sdo: <https://schema.org/>\n",
    "PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    # Our local endpoint, the repo name is defined in `data/graphdb-repo.ttl` \n",
    "    sparql = SPARQLWrapper(\"http://localhost:7210/repositories/pgt\") \n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            array.append(app)\n",
    "        print(len(array)) # Print the array length\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Improved version that also handles prefixes\n",
    "mappedPrefixes = {}\n",
    "for prefix in prefixString.split('\\n'):\n",
    "    if('PREFIX' in prefix):\n",
    "        prefix = prefix.replace('PREFIX', '', 1).split(':', 1)\n",
    "        mappedPrefixes[prefix[0].strip()] = prefix[1].strip().replace('<','').replace('>','')\n",
    "\n",
    "def query(queryString, replacePrefixes=True):\n",
    "    queryResults = run_query(queryString)\n",
    "    if(replacePrefixes):\n",
    "        for queryIndex, queryResultRaw in enumerate(queryResults):\n",
    "            for subQueryIndex, subQueryResultRaw in enumerate(queryResultRaw):\n",
    "                queryResult = queryResultRaw[subQueryIndex][1]\n",
    "                for prefixName, prefixValue in mappedPrefixes.items():\n",
    "                    queryResult = queryResult.replace(prefixValue, prefixName + ':')\n",
    "\n",
    "                queryResults[queryIndex][subQueryIndex] = (queryResultRaw[subQueryIndex][0], queryResult)\n",
    "\n",
    "        return queryResults\n",
    "    else: return queryResults\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Check if everything works:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('s', 'rdf:type'), ('p', 'rdf:type'), ('o', 'rdf:Property')],\n",
       " [('s', 'rdfs:subPropertyOf'), ('p', 'rdf:type'), ('o', 'rdf:Property')],\n",
       " [('s', 'rdfs:subPropertyOf'),\n",
       "  ('p', 'rdf:type'),\n",
       "  ('o', 'owl:TransitiveProperty')]]"
      ]
     },
     "execution_count": 77,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query(\"\"\"\n",
    "select distinct * {\n",
    "    ?s ?p ?o\n",
    "}\n",
    "LIMIT 3\n",
    "\"\"\", replacePrefixes=True)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1 - Get tour sites in order\n",
    "\n",
    "Let's start by .\n",
    "We would like to retrieve every site touched by a specific tour, with name and coordinates.\n",
    "\n",
    "If you just follow a naive approach, this is what you get:\n",
    "\n",
    "```\n",
    "[[('stepIndex', 'rdf:_1'), ('site', 'pgt:SITE1')],\n",
    " [('stepIndex', 'rdf:_10'), ('site', 'pgt:SITE10')],\n",
    " [('stepIndex', 'rdf:_11'), ('site', 'pgt:SITE11')],\n",
    " [('stepIndex', 'rdf:_12'), ('site', 'pgt:SITE12')],\n",
    " [('stepIndex', 'rdf:_13'), ('site', 'pgt:SITE13')],\n",
    " [('stepIndex', 'rdf:_14'), ('site', 'pgt:SITE14')],\n",
    " [('stepIndex', 'rdf:_15'), ('site', 'pgt:SITE15')],\n",
    " [('stepIndex', 'rdf:_2'), ('site', 'pgt:SITE2')],\n",
    " [('stepIndex', 'rdf:_3'), ('site', 'pgt:SITE3')],\n",
    " [('stepIndex', 'rdf:_4'), ('site', 'pgt:SITE4')],\n",
    " [('stepIndex', 'rdf:_5'), ('site', 'pgt:SITE5')],\n",
    " [('stepIndex', 'rdf:_6'), ('site', 'pgt:SITE6')],\n",
    " [('stepIndex', 'rdf:_7'), ('site', 'pgt:SITE7')],\n",
    " [('stepIndex', 'rdf:_8'), ('site', 'pgt:SITE8')],\n",
    " [('stepIndex', 'rdf:_9'), ('site', 'pgt:SITE9')]]\n",
    " ```\n",
    "\n",
    " This happens because `rdf:_15` has a lower lexicographical order than `rdf:_2`. To get the right order, we need to strip the `rdf:` prefix and cast the result to integer.\n",
    "\n",
    " We do not have name/lat/long for every site, some information are missing. To account for that, we use the `OPTIONAL` keyword."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "15\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('stepIndexNumber', '1'),\n",
       "  ('siteName', 'Museo archeologico'),\n",
       "  ('siteLat', '45.41096111111111'),\n",
       "  ('siteLong', '11.880011111111111')],\n",
       " [('stepIndexNumber', '2'),\n",
       "  ('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('siteLat', '45.41096111111111'),\n",
       "  ('siteLong', '11.880011111111111')],\n",
       " [('stepIndexNumber', '3'),\n",
       "  ('siteName', 'Museo Bottacin'),\n",
       "  ('siteLat', '45.411569444444446'),\n",
       "  ('siteLong', '11.878119444444446')],\n",
       " [('stepIndexNumber', '4'),\n",
       "  ('siteName', \"Museo del Risorgimento e dell'Età Contemporanea\"),\n",
       "  ('siteLat', '45.40784722222222'),\n",
       "  ('siteLong', '11.876925')],\n",
       " [('stepIndexNumber', '5'),\n",
       "  ('siteName', 'Museo di anatomia patologica (Padova)'),\n",
       "  ('siteLat', '45.405027777777775'),\n",
       "  ('siteLong', '11.8859')],\n",
       " [('stepIndexNumber', '6'),\n",
       "  ('siteName', 'Centro di Ateneo per i Musei - CAM')],\n",
       " [('stepIndexNumber', '7'),\n",
       "  ('siteName', 'Collezione privata Safilo'),\n",
       "  ('siteLat', '45.414833333333334'),\n",
       "  ('siteLong', '11.928894444444444')],\n",
       " [('stepIndexNumber', '8'),\n",
       "  ('siteName', 'Esapolis'),\n",
       "  ('siteLat', '45.39771944444444'),\n",
       "  ('siteLong', '11.834161111111111')],\n",
       " [('stepIndexNumber', '9'),\n",
       "  ('siteName', 'Museo veneto del giocattolo'),\n",
       "  ('siteLat', '45.37021388888889'),\n",
       "  ('siteLong', '11.830047222222221')],\n",
       " [('stepIndexNumber', '10'),\n",
       "  ('siteName', 'Museo antoniano'),\n",
       "  ('siteLat', '45.40136111111111'),\n",
       "  ('siteLong', '11.880069444444445')],\n",
       " [('stepIndexNumber', '11'),\n",
       "  ('siteName', 'Museo del precinema'),\n",
       "  ('siteLat', '45.40001111111111'),\n",
       "  ('siteLong', '11.875761111111112')],\n",
       " [('stepIndexNumber', '12'),\n",
       "  ('siteName', \"Museo dell'Educazione\"),\n",
       "  ('siteLat', '45.40576111111111'),\n",
       "  ('siteLong', '11.873130555555557')],\n",
       " [('stepIndexNumber', '13'), ('siteName', 'Museo di Antropologia (Padova)')],\n",
       " [('stepIndexNumber', '14'),\n",
       "  ('siteName', \"Museo di geografia dell'Università di Padova\"),\n",
       "  ('siteLat', '45.40496944444444'),\n",
       "  ('siteLong', '11.879111111111111')],\n",
       " [('stepIndexNumber', '15'),\n",
       "  ('siteName', \"Museo di storia della fisica dell'Università di Padova\"),\n",
       "  ('siteLat', '45.41043055555556'),\n",
       "  ('siteLong', '11.88576111111111')]]"
      ]
     },
     "execution_count": 78,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "tourName = \"Tour 1\"\n",
    "query('''\n",
    "SELECT ?stepIndexNumber ?siteName ?siteLat ?siteLong WHERE {\n",
    "    ?tour a pgt:Tour;\n",
    "          sdo:name \"''' + tourName + '''\";\n",
    "\t      pgt:steps ?stepNode .\n",
    "    ?stepNode ?stepIndex ?site .\n",
    "\n",
    "    BIND (STRLEN(\"http://www.w3.org/1999/02/22-rdf-syntax-ns#_\") AS ?prefixLength)\n",
    "    BIND (xsd:integer(SUBSTR(xsd:string(?stepIndex),?prefixLength + 1)) AS ?stepIndexNumber).\n",
    "\n",
    "    OPTIONAL{ ?site sdo:name ?siteName. }\n",
    "    OPTIONAL{ ?site geo:lat  ?siteLat.  }\n",
    "    OPTIONAL{ ?site geo:long ?siteLong. }\n",
    "\n",
    "\n",
    "} ORDER BY ?stepIndexNumber\n",
    "\n",
    "''')\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2 - Check for missing information\n",
    "\n",
    "In the previous query, we noticed some data is missing from a bunch of cultural sites. What if we want to check for missing data or orphan nodes?\n",
    "\n",
    "We may do this via sparQL, and use the `UNION` keyword to get all the errors at once."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "184\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('error', 'Missing geo data'), ('entity', 'pgt:SITE63')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE41')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE45')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE13')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE6')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITEsq3')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE105')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE106')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE108')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE110')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE112')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE114')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE116')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE117')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE119')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE133')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE134')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE135')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE136')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE137')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE138')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE139')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE145')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE22')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE23')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE25')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE26')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE27')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE31')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE34')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE37')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE50')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE59')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE64')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE65')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE69')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE82')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE85')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITEsq1')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE63')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE41')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE43')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE45')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE47')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE10')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE11')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE12')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE13')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE14')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE15')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE5')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE6')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE7')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE8')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE9')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE100')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE101')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE102')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE103')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE104')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE105')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE106')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE107')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE108')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE109')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE110')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE111')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE112')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE113')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE114')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE115')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE116')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE117')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE118')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE119')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE120')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE121')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE122')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE123')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE124')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE125')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE126')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE127')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE128')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE129')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE130')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE131')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE132')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE133')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE134')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE135')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE136')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE137')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE138')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE139')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE140')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE141')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE142')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE143')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE144')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE145')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE146')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE147')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE148')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE149')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE16')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE17')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE18')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE19')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE20')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE21')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE22')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE23')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE24')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE25')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE26')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE27')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE28')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE29')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE30')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE31')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE32')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE33')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE34')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE35')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE36')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE37')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE38')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE39')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE40')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE42')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE44')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE46')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE48')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE49')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE50')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE51')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE52')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE53')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE54')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE55')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE56')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE57')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE58')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE59')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE60')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE61')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE62')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE64')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE65')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE66')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE67')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE68')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE69')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE70')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE71')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE72')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE73')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE74')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE75')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE76')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE77')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE78')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE79')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE80')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE81')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE82')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE83')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE84')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE85')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE86')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE87')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE88')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE89')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE90')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE91')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE92')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE93')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE94')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE95')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE96')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE97')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE98')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE99')]]"
      ]
     },
     "execution_count": 79,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query('''\n",
    "SELECT DISTINCT ?error ?entity WHERE {\n",
    "\n",
    "\n",
    "    { \n",
    "        SELECT ?error (?site AS ?entity)  WHERE { \n",
    "            BIND( \"Missing geo data\" as ?error)\n",
    "            ?site a pgt:CulturalSite .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?site geo:lat ?lat;\n",
    "                    geo:long ?long.\n",
    "            }\n",
    "        }\n",
    "    } UNION { \n",
    "        SELECT ?error (?site AS ?entity)  WHERE { \n",
    "            BIND( \"Missing CulturalSiteCategory\" as ?error)\n",
    "            ?site a pgt:CulturalSite .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?artwork pgt:hasSite ?site;\n",
    "            }\n",
    "        }\n",
    "    } UNION { \n",
    "        SELECT ?error (?artwork AS ?entity)  WHERE { \n",
    "            BIND( \"Missing CulturalSite\" as ?error)\n",
    "            ?artwork a pgt:Artwork .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?artwork pgt:hasSite ?site;\n",
    "            }\n",
    "        }\n",
    "    } \n",
    "\n",
    "\n",
    "}\n",
    "''')\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 3 - Get sites by number of artworks\n",
    "\n",
    "Now we would like to create a new tour. In order to do so, we would like to see which sites have associated artwork, so we may pick meaningful sites.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[]]"
      ]
     },
     "execution_count": 80,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query('''\n",
    "SELECT DISTINCT ?error ?entity WHERE {\n",
    "\n",
    "\n",
    "}\n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 4 - Get sites by distance from a point\n",
    "\n",
    "https://graphdb.ontotext.com/documentation/9.6/free/using-math-functions-with-sparql.html\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "162.42020990254528 m\n",
      "0.7925707878840436 0.7925814053036598 0.20734530906241244 0.20731229325072892 1.0617419616276713e-05 -3.30158116835233e-05\n",
      "162.4202099022436 m\n",
      "1\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('lat1', '0.7925708'),\n",
       "  ('lat2', '0.79258144'),\n",
       "  ('lon1', '0.20734532'),\n",
       "  ('lon2', '0.20731232'),\n",
       "  ('dlat', '1.0609627E-5'),\n",
       "  ('dlon', '-3.3006072E-5'),\n",
       "  ('distance', '162.35992852325901')]]"
      ]
     },
     "execution_count": 81,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Python 3 program to calculate Distance Between Two Points on Earth\n",
    "from math import radians, cos, sin, asin, sqrt\n",
    "\n",
    "def distance(lat1, lat2, lon1, lon2):\n",
    "     \n",
    "    # The math module contains a function named\n",
    "    # radians which converts from degrees to radians.\n",
    "    lon1 = radians(lon1)\n",
    "    lon2 = radians(lon2)\n",
    "    lat1 = radians(lat1)\n",
    "    lat2 = radians(lat2)\n",
    "      \n",
    "    # Haversine formula\n",
    "    dlon = lon2 - lon1\n",
    "    dlat = lat2 - lat1\n",
    "    a = sin(dlat / 2)**2 + cos(lat1) * cos(lat2) * sin(dlon / 2)**2\n",
    " \n",
    "    c = 2 * asin(sqrt(a))\n",
    "    \n",
    "    # Radius of earth in kilometers = 6371. Use 3956 for miles\n",
    "    # Since we have small distances, I've changed it to meters\n",
    "    r = 6371 * 1000\n",
    "      \n",
    "    # calculate the result\n",
    "    return(c * r)\n",
    "\n",
    "def distance2(lat1, lat2, lon1, lon2):\n",
    "     \n",
    "    # The math module contains a function named\n",
    "    # radians which converts from degrees to radians.\n",
    "    lon1 = lon1 * 3.14159265359 / 180\n",
    "    lon2 = lon2 * 3.14159265359 / 180\n",
    "    lat1 = lat1 * 3.14159265359 / 180\n",
    "    lat2 = lat2 * 3.14159265359 / 180\n",
    "      \n",
    "\n",
    "    # Haversine formula\n",
    "    dlon = lon2 - lon1\n",
    "    dlat = lat2 - lat1\n",
    "    print(lat1, lat2, lon1, lon2, dlat, dlon)\n",
    "\n",
    "    return 2 * asin(sqrt(sin(dlat / 2)**2 + cos(lat1) * cos(lat2) * sin(dlon / 2)**2)) * 6371 * 1000\n",
    " \n",
    "    \n",
    "    \n",
    "\n",
    "'''\n",
    " [('stepIndexNumber', '2'),\n",
    "  ('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
    "  ('siteLat', '45.41096111111111'),\n",
    "  ('siteLong', '11.880011111111111')],\n",
    " [('stepIndexNumber', '3'),\n",
    "  ('siteName', 'Museo Bottacin'),\n",
    "  ('siteLat', '45.411569444444446'),\n",
    "  ('siteLong', '11.878119444444446')],\n",
    "'''\n",
    "# driver code\n",
    "lat1 = 45.41096111111111\n",
    "lat2 = 45.411569444444446\n",
    "lon1 = 11.880011111111111\n",
    "lon2 =  11.878119444444446\n",
    "print(distance(lat1, lat2, lon1, lon2), \"m\")\n",
    "print(distance2(lat1, lat2, lon1, lon2), \"m\")\n",
    "\n",
    "\n",
    "query('''\n",
    "SELECT DISTINCT ?lat1 ?lat2 ?lon1 ?lon2 ?dlat ?dlon ?distance {\n",
    "    BIND(\"''' + str(lat1) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lat1)\n",
    "    BIND(\"''' + str(lat2) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lat2)\n",
    "    BIND(\"''' + str(lon1) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lon1)\n",
    "    BIND(\"''' + str(lon2) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lon2)\n",
    "    BIND(?lat2 - ?lat1 AS ?dlat)\n",
    "    BIND(?lon2 - ?lon1 AS ?dlon)\n",
    "\n",
    "    BIND(2 * ofn:asin(ofn:sqrt(ofn:sin(?dlat / 2)* ofn:sin(?dlat / 2) + ofn:cos(?lat1) * ofn:cos(?lat2) * ofn:sin(?dlon / 2) * ofn:sin(?dlon / 2))) * 6371 * 1000 AS ?distance)\n",
    "\n",
    "}\n",
    "''')\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "105\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('siteName', 'Cappella degli Scrovegni'), ('distance', '46.1037033728453')],\n",
       " [('siteName', 'Museo archeologico'), ('distance', '67.59393234279999')],\n",
       " [('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('distance', '67.59393234279999')],\n",
       " [('siteName', 'Convento degli Eremitani'),\n",
       "  ('distance', '144.38608405467824')],\n",
       " [('siteName', 'Palazzo Zuckermann'), ('distance', '147.61968528552447')],\n",
       " [('siteName', 'Museo Bottacin'), ('distance', '147.61968528552447')],\n",
       " [('siteName', 'Complesso Cavalli'), ('distance', '157.8335972843654')],\n",
       " [('siteName', 'Palazzo Cavalli alle Porte Contarine'),\n",
       "  ('distance', '159.12098280757957')],\n",
       " [('siteName', 'Porte Contarine'), ('distance', '200.9640879391254')],\n",
       " [('siteName', 'Porta Altinate'), ('distance', '320.81427483311955')],\n",
       " [('siteName', 'Centro culturale Altinate/San Gaetano'),\n",
       "  ('distance', '345.47557984269116')],\n",
       " [('siteName', 'Chiesa di San Gaetano (Padova)'),\n",
       "  ('distance', '383.76138408772346')],\n",
       " [('siteName', 'Chiesa di San Fermo (Padova)'),\n",
       "  ('distance', '385.72263485422246')],\n",
       " [('siteName', \"Chiesa di Sant'Andrea (Padova)\"),\n",
       "  ('distance', '421.2074001837105')],\n",
       " [('siteName', \"Gatta di Sant'Andrea\"), ('distance', '435.1936794167633')],\n",
       " [('siteName', 'Scuola del Carmine'), ('distance', '462.63046530677985')],\n",
       " [('siteName', \"Museo di storia della fisica dell'Università di Padova\"),\n",
       "  ('distance', '466.3339553578984')],\n",
       " [('siteName', 'Caffè Pedrocchi'), ('distance', '474.76635923549196')],\n",
       " [('siteName', \"Museo del Risorgimento e dell'Età Contemporanea\"),\n",
       "  ('distance', '478.9320272987948')],\n",
       " [('siteName', 'Chiesa di Santa Lucia (Padova)'),\n",
       "  ('distance', '481.12863902491733')],\n",
       " [('siteName', 'Scuola di San Rocco (Padova)'),\n",
       "  ('distance', '483.36168000288666')],\n",
       " [('siteName', 'Ponte Molino'), ('distance', '488.9607692549007')],\n",
       " [('siteName', 'Porta Molino'), ('distance', '493.36086393807267')],\n",
       " [('siteName', 'Basilica del Carmine (Padova)'),\n",
       "  ('distance', '496.1177237374017')],\n",
       " [('siteName', 'Palazzo Folco'), ('distance', '538.9359074541471')],\n",
       " [('siteName', 'Tempio della Pace (Padova)'),\n",
       "  ('distance', '569.125508329447')],\n",
       " [('siteName', 'Palazzo del Bo'), ('distance', '576.121986835045')],\n",
       " [('siteName', 'Palazzo del Monte di Pietà Vecchio'),\n",
       "  ('distance', '579.5053123757905')],\n",
       " [('siteName', 'Palazzo Maldura'), ('distance', '585.8234772569133')],\n",
       " [('siteName', 'Palazzo Comunale (Padova)'),\n",
       "  ('distance', '586.3663700642029')],\n",
       " [('siteName', 'Chiesa di Santa Sofia (Padova)'),\n",
       "  ('distance', '603.2706140100445')],\n",
       " [('siteName', 'Palazzo della Ragione (Padova)'),\n",
       "  ('distance', '608.4922042248435')],\n",
       " [('siteName', 'Palazzo Zabarella'), ('distance', '623.6318232827416')],\n",
       " [('siteName', 'Ponte di San Lorenzo'), ('distance', '629.793676548392')],\n",
       " [('siteName', 'Chiesa di San Clemente (Padova)'),\n",
       "  ('distance', '634.5946703230164')],\n",
       " [('siteName', 'Chiesa di San Canziano (Padova)'),\n",
       "  ('distance', '646.5263948454124')],\n",
       " [('siteName', 'Palazzo delle Debite'), ('distance', '651.5718290762179')],\n",
       " [('siteName', 'Tomba di Antenore'), ('distance', '655.983666636137')],\n",
       " [('siteName', 'Chiesa di San Nicolò (Padova)'),\n",
       "  ('distance', '662.3878345241047')],\n",
       " [('siteName', 'Chiesa di Santa Margherita (Padova)'),\n",
       "  ('distance', '694.4221540228286')],\n",
       " [('siteName', 'MUSME'), ('distance', '702.2258131831054')],\n",
       " [('siteName', 'Ospedale di San Francesco Grande'),\n",
       "  ('distance', '702.2258131831054')],\n",
       " [('siteName', \"Torre dell'Orologio (Padova)\"),\n",
       "  ('distance', '704.8480489531662')],\n",
       " [('siteName', 'Mura di Padova'), ('distance', '705.5827857525393')],\n",
       " [('siteName', 'Chiesa del Beato Antonio Pellegrino'),\n",
       "  ('distance', '709.3486997652653')],\n",
       " [('siteName', 'Complesso Ingegneria'), ('distance', '710.1187026601551')],\n",
       " [('siteName', \"Chiesa di Sant'Eufemia (Padova)\"),\n",
       "  ('distance', '714.8771805011403')],\n",
       " [('siteName', 'Sinagoga di Padova di rito italiano'),\n",
       "  ('distance', '730.2332418671696')],\n",
       " [('siteName', \"Museo di geografia dell'Università di Padova\"),\n",
       "  ('distance', '737.3998509032723')],\n",
       " [('siteName', 'Palazzo Wollemborg'), ('distance', '743.5927892308702')],\n",
       " [('siteName', 'Chiesa di San Francesco Grande (Padova)'),\n",
       "  ('distance', '748.3085156278748')],\n",
       " [('siteName', 'Palazzo del Monte di Pietà Nuovo'),\n",
       "  ('distance', '769.1871478666558')],\n",
       " [('siteName', 'Sala dei Giganti (Padova)'), ('distance', '773.122520136015')],\n",
       " [('siteName', 'Palazzo Liviano'), ('distance', '789.8558249041774')],\n",
       " [('siteName', 'Museo diocesano (Padova)'), ('distance', '796.6991218779372')],\n",
       " [('siteName', 'Arco Valaresso'), ('distance', '804.6619376418193')],\n",
       " [('siteName', 'Loggia dei Carraresi'), ('distance', '825.6988726025962')],\n",
       " [('siteName', 'Battistero di Padova'), ('distance', '832.0115456317573')],\n",
       " [('siteName', 'Palazzo ECA (ex)'), ('distance', '837.2815827479159')],\n",
       " [('siteName', \"Museo dell'Educazione\"), ('distance', '840.0831394334747')],\n",
       " [('siteName', 'Chiesa di Santa Maria dei Servi (Padova)'),\n",
       "  ('distance', '842.0149334388736')],\n",
       " [('siteName', 'Museo di anatomia patologica (Padova)'),\n",
       "  ('distance', '860.6303912889346')],\n",
       " [('siteName', \"Chiesa dell'Immacolata (Padova)\"),\n",
       "  ('distance', '870.9190229122064')],\n",
       " [('siteName', 'Chiesa di Santa Caterina (Padova)'),\n",
       "  ('distance', '870.9742611815559')],\n",
       " [('siteName', 'Duomo di Padova'), ('distance', '905.7853435042784')],\n",
       " [('siteName', 'Chiesa di San Pietro Apostolo (Padova)'),\n",
       "  ('distance', '932.7082057505356')],\n",
       " [('siteName', \"Chiesa di Sant'Antonio di Vienna\"),\n",
       "  ('distance', '934.1767088169231')],\n",
       " [('siteName', 'Chiesa di San Benedetto Vecchio'),\n",
       "  ('distance', '1032.971000283856')],\n",
       " [('siteName', 'Loggia e Odeo Cornaro'), ('distance', '1052.5258846177153')],\n",
       " [('siteName', 'Chiesa di San Benedetto Novello'),\n",
       "  ('distance', '1056.542791243528')],\n",
       " [('siteName', 'Palazzo Mussato'), ('distance', '1060.6911998232968')],\n",
       " [('siteName', 'Palazzo Pisani de Lazzara'),\n",
       "  ('distance', '1061.880159905903')],\n",
       " [('siteName', 'Monumento equestre al Gattamelata'),\n",
       "  ('distance', '1132.2325997720432')],\n",
       " [('siteName', 'Museo antoniano'), ('distance', '1135.435478252382')],\n",
       " [('siteName', \"Basilica di Sant'Antonio di Padova\"),\n",
       "  ('distance', '1136.646422247902')],\n",
       " [('siteName', 'Oratorio di San Giorgio (Padova)'),\n",
       "  ('distance', '1167.4945388881779')],\n",
       " [('siteName', 'Palazzo Capodilista'), ('distance', '1181.58915862698')],\n",
       " [('siteName', 'Chiesa di San Massimo (Padova)'),\n",
       "  ('distance', '1186.1991701912905')],\n",
       " [('siteName', 'Porta Savonarola'), ('distance', '1192.9587820654192')],\n",
       " [('siteName', 'Chiesa di San Daniele (Padova)'),\n",
       "  ('distance', '1207.0088431809218')],\n",
       " [('siteName', \"Santuario dell'Arcella\"), ('distance', '1226.3172488829225')],\n",
       " [('siteName', 'Chiesa di San Tomaso Cantuariense (Padova)'),\n",
       "  ('distance', '1268.681993391505')],\n",
       " [('siteName', 'Chiesa di Santa Maria in Vanzo'),\n",
       "  ('distance', '1287.77459045358')],\n",
       " [('siteName', 'Castelvecchio (Padova)'), ('distance', '1303.8338871350618')],\n",
       " [('siteName', 'Chiesa di San Prosdocimo (Padova)'),\n",
       "  ('distance', '1303.919555210438')],\n",
       " [('siteName', 'Palazzo Angeli (Padova)'), ('distance', '1313.2538172832112')],\n",
       " [('siteName', 'Museo del precinema'), ('distance', '1327.2041203270603')],\n",
       " [('siteName', 'Palazzina del prefetto (ex)'),\n",
       "  ('distance', '1333.659938708827')],\n",
       " [('siteName', 'Chiesa di Ognissanti (Padova)'),\n",
       "  ('distance', '1376.683844914645')],\n",
       " [('siteName', 'Chiesa di Santa Maria del Torresino'),\n",
       "  ('distance', '1387.5482859342253')],\n",
       " [('siteName', 'Specola di Padova'), ('distance', '1393.7340841620553')],\n",
       " [('siteName', 'Oratorio di San Michele (Padova)'),\n",
       "  ('distance', '1420.9838042932233')],\n",
       " [('siteName', 'Porta San Giovanni (Padova)'),\n",
       "  ('distance', '1427.0171596723155')],\n",
       " [('siteName', 'Loggia Amulea'), ('distance', '1433.6225599027305')],\n",
       " [('siteName', 'Chiesa delle Dimesse'), ('distance', '1513.1936205188306')],\n",
       " [('siteName', 'Palazzo Grimani (Padova)'), ('distance', '1608.626629061492')],\n",
       " [('siteName', 'Chiesa di Santa Maria delle Grazie (Padova)'),\n",
       "  ('distance', '1617.019958945723')],\n",
       " [('siteName', 'Basilica di Santa Giustina'),\n",
       "  ('distance', '1688.4797073590457')],\n",
       " [('siteName', 'Muro di Padova'), ('distance', '1890.2772156094343')],\n",
       " [('siteName', 'Chiesa di San Carlo Borromeo (Padova)'),\n",
       "  ('distance', '2061.561117902353')],\n",
       " [('siteName', 'Scuola del Redentore'), ('distance', '2147.2318945766556')],\n",
       " [('siteName', 'Chiesa di Santa Croce (Padova)'),\n",
       "  ('distance', '2173.9432972461836')],\n",
       " [('siteName', 'Santuario di San Leopoldo Mandic'),\n",
       "  ('distance', '2212.66128926689')],\n",
       " [('siteName', 'Cimitero Maggiore (Padova)'),\n",
       "  ('distance', '2448.900146760721')],\n",
       " [('siteName', \"Tempio nazionale dell'internato ignoto\"),\n",
       "  ('distance', '2887.9788235602605')]]"
      ]
     },
     "execution_count": 82,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "lat = 45.411569444444446\n",
    "lon = 11.880011111111111\n",
    "maxDistance = 3000 # meters\n",
    "\n",
    "query('''\n",
    "SELECT DISTINCT ?siteName ?distance {\n",
    "    BIND(\"''' + str(lat) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lat1)\n",
    "    BIND(\"''' + str(lon) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lon1)\n",
    "\n",
    "    ?site a pgt:CulturalSite .\n",
    "    ?site sdo:name ?siteName .\n",
    "\n",
    "    ?site geo:lat  ?lat2deg .\n",
    "    ?site geo:long ?lon2deg .\n",
    "\n",
    "\n",
    "    BIND(?lat2deg * 3.14159265359 / 180 as ?lat2)\n",
    "    BIND(?lon2deg * 3.14159265359 / 180 as ?lon2)\n",
    "    BIND(?lat2 - ?lat1 AS ?dlat)\n",
    "    BIND(?lon2 - ?lon1 AS ?dlon)\n",
    "\n",
    "    BIND(2 * ofn:asin(ofn:sqrt(ofn:sin(?dlat / 2)* ofn:sin(?dlat / 2) + ofn:cos(?lat1) * ofn:cos(?lat2) * ofn:sin(?dlon / 2) * ofn:sin(?dlon / 2))) * 6371 * 1000 AS ?distance)\n",
    "\n",
    "    FILTER(?distance < \"''' + str(maxDistance) + '''\"^^xsd:float).\n",
    "}ORDER BY ?distance LIMIT 1000\n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 5 - Get sites by artwork material"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 6 - Generate a new tour\n",
    "\n",
    "This query will generate a tour given the name, description and visited sites (as a list of names of cultural sites).\n",
    "\n",
    "This is more a proof of concept than an actual useful query, since it would make way more sense to use a programming language to generate part of the query (for example, the UUID could be generated in Python instead) instead of a pure sparQL call.\n",
    "\n",
    "You may safely run this query multiple times: thanks to the `BIND` + `MINUS` keywords, the insertion is skipped if a tour with the same name already exists."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "```\n",
    "PREFIX pgt: <https://padovagrandtour.github.io/entitites#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX sdo: <https://schema.org/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "INSERT { \n",
    "    ?tourID a pgt:Tour.\n",
    "    ?tourStepsID a rdf:Seq.\n",
    "\n",
    "    ?tourID pgt:steps ?tourStepsID.\n",
    "    ?tourID sdo:name ?tourName.\n",
    "    ?tourID sdo:description ?tourDescription.\n",
    "    \n",
    "    ?tourStepsID ?isStep ?stepSite.\n",
    "\n",
    "} WHERE { \n",
    "    BIND(\"New Tour2\" as ?tourName).\n",
    "    BIND(\"Tour descriptionssss\" as ?tourDescription).\n",
    "    MINUS { \n",
    "        ?checkingTour a pgt:Tour;\n",
    "           sdo:name ?tourName.\n",
    "    }.\n",
    "    BIND(StrUUID() AS ?uuidCode) . \n",
    "    BIND(URI(CONCAT(\"https://padovagrandtour.github.io/entitites#TOUR-\", ?uuidCode)) AS ?tourID).\n",
    "    BIND(URI(CONCAT(\"https://padovagrandtour.github.io/entitites#TOURSTEPS-\", ?uuidCode)) AS ?tourStepsID).\n",
    "    \n",
    "    \n",
    "    VALUES (?stepIndex ?stepName) {\n",
    "        (1 \"Chiesa di San Bonaventura delle Eremite\")\n",
    "        (2 \"Battistero di Padova\")\n",
    "    }\n",
    "    \n",
    "    BIND(URI(CONCAT(\"http://www.w3.org/1999/02/22-rdf-syntax-ns#_\", STR(?stepIndex))) AS ?isStep).\n",
    "    ?stepSite a pgt:CulturalSite;\n",
    "          sdo:name ?stepName.\n",
    "\n",
    "\n",
    "\n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The operation failed QueryBadFormed: A bad request has been sent to the endpoint: probably the SPARQL query is badly formed. \n",
      "\n",
      "Response:\n",
      "b'MALFORMED QUERY: Encountered \"<EOF>\" at line 14, column 1.\\nWas expecting one of:\\n    \"base\" ...\\n    \"prefix\" ...\\n    \"select\" ...\\n    \"construct\" ...\\n    \"describe\" ...\\n    \"ask\" ...\\n    '\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/luca-fabbian/.local/lib/python3.10/site-packages/SPARQLWrapper/Wrapper.py:623: RuntimeWarning: not detected query type for query '' PREFIX ofn: <http://www.ontotext.com/sparql/functions/> PREFIX owl: <http://www.w3.org/2002/07/owl#>  PREFIX pgt: <https://padovagrandtour.github.io/entitites#>  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>  PREFIX xml: <http://www.w3.org/XML/1998/namespace>  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>  PREFIX sdo: <https://schema.org/> PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>      ''\n",
      "  warnings.warn(\n",
      "/home/luca-fabbian/.local/lib/python3.10/site-packages/SPARQLWrapper/Wrapper.py:633: RuntimeWarning: unknown query type 'None'\n",
      "  warnings.warn(\"unknown query type '%s'\" % r_queryType, RuntimeWarning)\n"
     ]
    },
    {
     "ename": "TypeError",
     "evalue": "'NoneType' object is not iterable",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mTypeError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m/tmp/ipykernel_2777/2298909584.py\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m      9\u001b[0m '''\n\u001b[1;32m     10\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 11\u001b[0;31m query('''\n\u001b[0m\u001b[1;32m     12\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     13\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/tmp/ipykernel_2777/4263647052.py\u001b[0m in \u001b[0;36mquery\u001b[0;34m(queryString, replacePrefixes)\u001b[0m\n\u001b[1;32m      9\u001b[0m     \u001b[0mqueryResults\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mrun_query\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mqueryString\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     10\u001b[0m     \u001b[0;32mif\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreplacePrefixes\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 11\u001b[0;31m         \u001b[0;32mfor\u001b[0m \u001b[0mqueryIndex\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mqueryResultRaw\u001b[0m \u001b[0;32min\u001b[0m \u001b[0menumerate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mqueryResults\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     12\u001b[0m             \u001b[0;32mfor\u001b[0m \u001b[0msubQueryIndex\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msubQueryResultRaw\u001b[0m \u001b[0;32min\u001b[0m \u001b[0menumerate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mqueryResultRaw\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     13\u001b[0m                 \u001b[0mqueryResult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mqueryResultRaw\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0msubQueryIndex\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;36m1\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mTypeError\u001b[0m: 'NoneType' object is not iterable"
     ]
    }
   ],
   "source": [
    "tourName = \"Generated Tour\"\n",
    "tourDescription = \"Description of generated tour\"\n",
    "\n",
    "# It would be nice to avoid manual index assigning of sites' indexes,\n",
    "# however, this is not possible, since sparQL lists are always unordered ones.\n",
    "tourSteps = '''\n",
    "    (1 \"\")\n",
    "\n",
    "'''\n",
    "\n",
    "query('''\n",
    "\n",
    "\n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 7 - Get a tour preview\n",
    "\n",
    "Getting some random artworks of what we are going to see in a tour."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('siteName', \"Museo del Risorgimento e dell'Età Contemporanea\"),\n",
       "  ('artworkName', \"L'insurrezione contro gli Austriaci al Pedrocchi nel 1848\"),\n",
       "  ('artworkDescription',\n",
       "   \"Si tratta di un particolare della copertina del numero unico &quot;8 febbraio 1848-98&quot; edito dallo Stabilimento tipo-litografico P. Prosperini di Padova nel 1898. Rappresenta un episodio degli scontri tra gli studenti e i cittadini padovani e l'esercito austriaco avvenuto l'8 febbraio 1848, con l'uccisione degli studenti Giovanni Battista Ricci di Verona (colpito in via del Sale, ora Oberdan, morì qualche giorno dopo in conseguenza delle ferite riportate) e Giovanni Anghinoni di Bozzolo (Mantova), ucciso con un colpo di baionetta dalla sentinella di guardia all'ufficio postale mentre saltava da una finestra del Caffè Pedrocchi per sottrarsi alla furia dei soldati che avevano invaso il locale (trascinatosi a stento verso casa, cadde sfinito e spirò nella via del Portelletto che oggi porta il suo nome), che vide inoltre un centinaio di feriti. \"),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/4340.jpg?itok=hXF5zyvf'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-risorgimento-eta-contemporanea/collezioni/oggetti-storici/insurrezione-contro-austriaci-pedrocchi-1848')],\n",
       " [('siteName', 'Museo Bottacin'),\n",
       "  ('artworkName', 'Ritratto di Nicola Bottacin'),\n",
       "  ('artworkDescription',\n",
       "   'Ritratto di Nicola Bottacin. Dipinto commissionato al pittore- ritrattista padovano Augusto Caratti da parte del Comune di Padova per il museo Bottacin, con ogni probabilità il ritratto di Nicola Bottacin venne ripreso non dal vivo ma da un ritratto fotografico.'),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/18843.jpg?itok=6mE2bsGG'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-bottacin/collezioni/oggetti-vari/ritratto-nicola-bottacin')],\n",
       " [('siteName', 'Museo Bottacin'),\n",
       "  ('artworkName', 'Medaglia commemorativa morte Garibaldi'),\n",
       "  ('artworkDescription', 'Medaglia commemorativa morte Garibaldi'),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/19633.jpg?itok=zpNfSo_M'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-bottacin/collezioni/medaglie-monete-decorazioni-sigilli/medaglia-commemorativa-morte-garibaldi')],\n",
       " [('siteName', 'Museo Bottacin'),\n",
       "  ('artworkName', 'Terzo di statere con testa di leone'),\n",
       "  ('artworkDescription', 'Terzo di statere con testa di leone '),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/94828.jpg?itok=GDinOKLP'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-bottacin/collezioni/monete/terzo-statere-testa-leone')],\n",
       " [('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('artworkName', 'Allegoria della Pittura'),\n",
       "  ('artworkDescription',\n",
       "   'La giovane figura femminile è ritratta nell’atto di apprestarsi a dipingere, con il busto volto di tre quarti e gli occhi fissi su un’immagine fuori campo. Essa rinvia alla statuaria antica piuttosto che a un ritratto dal vero, ed è anche in ragione di ciò che l’immagine va interpretata come allegoria della Pittura.<br/>\\nCarpioni, nato a Venezia, ma vicentino d’adozione, imposta la tela secondo una definizione netta delle forme, accordata su una gamma cromatica timbrica, che esclude valori tonali e chiaroscurali. '),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/9698.jpg?itok=NY8KocEk'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-arte-medievale-moderna/collezioni/dipinti/allegoria-pittura')],\n",
       " [('siteName', \"Museo del Risorgimento e dell'Età Contemporanea\"),\n",
       "  ('artworkName', 'Cimeli'),\n",
       "  ('artworkDescription',\n",
       "   'Elmetto italiano, modello Adrian 16, tra i più diffusi durante la I Guerra Mondiale. Riprende un modello francese (creato da Louis Auguste Adrian), ma si compone di 2 pezzi e non di 4: questo aspetto tecnico lo rende più forte agli urti. Inoltre era più leggero: il modello precedente Farina pesava 2,5 kg, questo solo 600 gr. Si compone di calotta, crestina, coprinuca, visiera, sottogola in cuoio e internamente poteva essere imbottito in pelle marrone o feltro grigio, inoltre possedeva fori per la ventilazione. Gli elmetti sono stati necessari dalla I Guerra Mondiale, quando i soldati erano costretti a combattere nelle trincee: spesso erano mimetizzati oltre che dal colore grigio, verde o bruno, anche con il fango e con foglie applicate con un collante. Questo esemplare reca il buco causato probabilmente da un proiettile.'),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/2084.jpg?itok=61R46uPf'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-risorgimento-eta-contemporanea/collezioni/oggetti-storici/cimeli-0')],\n",
       " [('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('artworkName', \"Paesaggio con arco naturale su un corso d'acqua e figure\"),\n",
       "  ('artworkDescription',\n",
       "   \"Il paesaggio ha un aspetto impervio e ostile. Su un arco roccioso dei soldati, variamente atteggiati riposano, mentre altre figure emergono faticosamente da un pendio sottostante. Lo sfondo è apenna abbozzato: si profilano dei monti e si intravvede qualche architettura. La gamma cromatica è piuttosto ristretta, dato che sono utilizzate le stesse tinte sia per le rocce sia per le figure.   <br/>\\nSiamo nell'ambito del &quot;paesaggio barocco o di fantasia&quot;, inaugurato a Napoli nel corso del Seicento da Salvator Rosa. Secondo la poetica barocca la natura suscita in noi delle emozioni, perché si rivela nella sua forza selvaggia e potente, infinitamente superiore all'uomo.       <br/>\\n\"),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/6869.jpg?itok=g4N5ufeg'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-arte-medievale-moderna/collezioni/dipinti/paesaggio-arco-naturale-corso-acqua-figure')],\n",
       " [('siteName', 'Museo Bottacin'),\n",
       "  ('artworkName', \"Ducato d'oro di Francesco I da Carrara\"),\n",
       "  ('artworkDescription', \"Ducato d'oro di Francesco I da Carrara \"),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/94946.jpg?itok=gVuWVgi4'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-bottacin/collezioni/monete/ducato-oro-francesco-carrara')],\n",
       " [('siteName', 'Museo Bottacin'),\n",
       "  ('artworkName', \"Aureo dell'imperatore Cesare Augusto\"),\n",
       "  ('artworkDescription', \"Aureo dell'imperatore Cesare Augusto\"),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/94945.jpg?itok=IJLgACSQ'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-bottacin/collezioni/monete/aureo-imperatore-cesare-augusto')],\n",
       " [('siteName', \"Museo del Risorgimento e dell'Età Contemporanea\"),\n",
       "  ('artworkName', 'Cimeli'),\n",
       "  ('artworkDescription',\n",
       "   \"Rosa in tessuto dorato donata nel 1989 da Zipora Dak a Giorgio Perlasca a Gerusalemme Perlasca come ringraziamento per aver salvato migliaia di ebrei ungheresi. La scritta sul biglietto che l'accompagna, recita nella traduzione italiana: &quot;Tu hai salvato due membri della mia famiglia e la mia fiducia - che stava scomparendo - nella razza umana. Grazie&quot;\"),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/3029.jpg?itok=d-evJQ4p'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-risorgimento-eta-contemporanea/collezioni/oggetti-storici/cimeli-1')]]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query('''\n",
    "SELECT ?siteName ?artworkName ?artworkDescription ?artworkImage ?artworkURL WHERE {\n",
    "    ?tour a pgt:Tour;\n",
    "          sdo:name \"Tour 1\";\n",
    "\t      pgt:steps ?stepNode .\n",
    "          \n",
    "    ?stepNode ?stepIndex ?site .\n",
    "\n",
    "    ?site sdo:name ?siteName .\n",
    "\n",
    "    ?artwork pgt:hasSite ?site;\n",
    "             sdo:image ?artworkImage;\n",
    "             sdo:name ?artworkName;\n",
    "             sdo:url ?artworkURL;\n",
    "             sdo:description ?artworkDescription.\n",
    "\n",
    "} ORDER BY RAND() LIMIT 10\n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 8 - Get tour recap/metrics\n",
    "\n",
    "In this query we get some metrics about the whole tour, such as the total travelled distance and the average year of the artwork we are going to see."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query('''\n",
    "SELECT ((AVG(?year) as ?mediumAge) (SUM(?distance) ?tourLength WHERE {\n",
    "    ?artwork a pgt:Artwork;\n",
    "            pgt:hasSite ?site; \n",
    "            xsd:material ?material.\n",
    "} ORDER BY ?material\n",
    "LIMIT 100\n",
    "''') "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 9 - Aggregate query : Which period has the most artworks in poor conservation state among Padova cultural sites?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query(''' \n",
    "    SELECT ?year (COUNT(?artwork) AS ?count) WHERE { \n",
    "        ?artwork pgt:yearCreatedText ?year; \n",
    "                 pgt:conservationState \"Mutilo\" \n",
    "} \n",
    "GROUP BY (?year) \n",
    "ORDER BY DESC (?count) \n",
    "LIMIT 1 \n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 10 -"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.6 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.6"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "916dbcbb3f70747c44a77c7bcd40155683ae19c65e1c03b4aa3499c5328201f1"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
