{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Padova Grand Tour - Queries\n",
    "\n",
    "This notebook will provide ten insightful queries about our data. Get started by starting GraphDB with `docker compose up --force-recreate`.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Sparql wrapper (copy and pasted from the Individual Project's notebooks):"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "# Taken from `data/ttlData/ontology.ttl`\n",
    "prefixString = \"\"\"\n",
    "PREFIX ofn: <http://www.ontotext.com/sparql/functions/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#> \n",
    "PREFIX pgt: <https://padovagrandtour.github.io/entities#> \n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace> \n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> \n",
    "PREFIX sdo: <https://schema.org/>\n",
    "PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    # Our local endpoint, the repo name is defined in `data/graphdb-repo.ttl` \n",
    "    sparql = SPARQLWrapper(\"http://localhost:7210/repositories/pgt\") \n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            array.append(app)\n",
    "        print(len(array)) # Print the array length\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Improved version that also handles prefixes\n",
    "mappedPrefixes = {}\n",
    "for prefix in prefixString.split('\\n'):\n",
    "    if('PREFIX' in prefix):\n",
    "        prefix = prefix.replace('PREFIX', '', 1).split(':', 1)\n",
    "        mappedPrefixes[prefix[0].strip()] = prefix[1].strip().replace('<','').replace('>','')\n",
    "\n",
    "def query(queryString, replacePrefixes=True):\n",
    "    queryResults = run_query(queryString)\n",
    "    if(replacePrefixes):\n",
    "        for queryIndex, queryResultRaw in enumerate(queryResults):\n",
    "            for subQueryIndex, subQueryResultRaw in enumerate(queryResultRaw):\n",
    "                queryResult = queryResultRaw[subQueryIndex][1]\n",
    "                for prefixName, prefixValue in mappedPrefixes.items():\n",
    "                    queryResult = queryResult.replace(prefixValue, prefixName + ':')\n",
    "\n",
    "                queryResults[queryIndex][subQueryIndex] = (queryResultRaw[subQueryIndex][0], queryResult)\n",
    "\n",
    "        return queryResults\n",
    "    else: return queryResults\n",
    "\n",
    "\n",
    "def insertQuery(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    # Our local endpoint, the repo name is defined in `data/graphdb-repo.ttl` \n",
    "    sparql = SPARQLWrapper(\"http://localhost:7210/repositories/pgt/statements\") \n",
    "    sparql.setTimeout(300)\n",
    "    sparql.method = \"POST\"\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)    \n",
    "    sparql.queryType = \"INSERT\"\n",
    "    results = sparql.query()\n",
    "    return results.convert()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Check if everything works:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('s', 'rdf:type'), ('p', 'rdf:type'), ('o', 'rdf:Property')],\n",
       " [('s', 'rdfs:subPropertyOf'), ('p', 'rdf:type'), ('o', 'rdf:Property')],\n",
       " [('s', 'rdfs:subPropertyOf'),\n",
       "  ('p', 'rdf:type'),\n",
       "  ('o', 'owl:TransitiveProperty')]]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query(\"\"\"\n",
    "select distinct * {\n",
    "    ?s ?p ?o\n",
    "}\n",
    "LIMIT 3\n",
    "\"\"\", replacePrefixes=True)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1 - Get tour sites in order\n",
    "\n",
    "Let's start by .\n",
    "We would like to retrieve every site touched by a specific tour, with name and coordinates.\n",
    "\n",
    "If you just follow a naive approach, this is what you get:\n",
    "\n",
    "```\n",
    "[[('stepIndex', 'rdf:_1'), ('site', 'pgt:SITE1')],\n",
    " [('stepIndex', 'rdf:_10'), ('site', 'pgt:SITE10')],\n",
    " [('stepIndex', 'rdf:_11'), ('site', 'pgt:SITE11')],\n",
    " [('stepIndex', 'rdf:_12'), ('site', 'pgt:SITE12')],\n",
    " [('stepIndex', 'rdf:_13'), ('site', 'pgt:SITE13')],\n",
    " [('stepIndex', 'rdf:_14'), ('site', 'pgt:SITE14')],\n",
    " [('stepIndex', 'rdf:_15'), ('site', 'pgt:SITE15')],\n",
    " [('stepIndex', 'rdf:_2'), ('site', 'pgt:SITE2')],\n",
    " [('stepIndex', 'rdf:_3'), ('site', 'pgt:SITE3')],\n",
    " [('stepIndex', 'rdf:_4'), ('site', 'pgt:SITE4')],\n",
    " [('stepIndex', 'rdf:_5'), ('site', 'pgt:SITE5')],\n",
    " [('stepIndex', 'rdf:_6'), ('site', 'pgt:SITE6')],\n",
    " [('stepIndex', 'rdf:_7'), ('site', 'pgt:SITE7')],\n",
    " [('stepIndex', 'rdf:_8'), ('site', 'pgt:SITE8')],\n",
    " [('stepIndex', 'rdf:_9'), ('site', 'pgt:SITE9')]]\n",
    " ```\n",
    "\n",
    " This happens because `rdf:_15` has a lower lexicographical order than `rdf:_2`. To get the right order, we need to strip the `rdf:` prefix and cast the result to integer.\n",
    "\n",
    " We do not have name/lat/long for every site, some information are missing. To account for that, we use the `OPTIONAL` keyword."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "15\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('stepIndexNumber', '1'),\n",
       "  ('siteName', 'Museo archeologico'),\n",
       "  ('siteLat', '45.41096111111111'),\n",
       "  ('siteLong', '11.880011111111111')],\n",
       " [('stepIndexNumber', '2'),\n",
       "  ('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('siteLat', '45.41096111111111'),\n",
       "  ('siteLong', '11.880011111111111')],\n",
       " [('stepIndexNumber', '3'),\n",
       "  ('siteName', 'Museo Bottacin'),\n",
       "  ('siteLat', '45.411569444444446'),\n",
       "  ('siteLong', '11.878119444444446')],\n",
       " [('stepIndexNumber', '4'),\n",
       "  ('siteName', \"Museo del Risorgimento e dell'Età Contemporanea\"),\n",
       "  ('siteLat', '45.40784722222222'),\n",
       "  ('siteLong', '11.876925')],\n",
       " [('stepIndexNumber', '5'),\n",
       "  ('siteName', 'Museo di anatomia patologica (Padova)'),\n",
       "  ('siteLat', '45.405027777777775'),\n",
       "  ('siteLong', '11.8859')],\n",
       " [('stepIndexNumber', '6'),\n",
       "  ('siteName', 'Centro di Ateneo per i Musei - CAM')],\n",
       " [('stepIndexNumber', '7'),\n",
       "  ('siteName', 'Collezione privata Safilo'),\n",
       "  ('siteLat', '45.414833333333334'),\n",
       "  ('siteLong', '11.928894444444444')],\n",
       " [('stepIndexNumber', '8'),\n",
       "  ('siteName', 'Esapolis'),\n",
       "  ('siteLat', '45.39771944444444'),\n",
       "  ('siteLong', '11.834161111111111')],\n",
       " [('stepIndexNumber', '9'),\n",
       "  ('siteName', 'Museo veneto del giocattolo'),\n",
       "  ('siteLat', '45.37021388888889'),\n",
       "  ('siteLong', '11.830047222222221')],\n",
       " [('stepIndexNumber', '10'),\n",
       "  ('siteName', 'Museo antoniano'),\n",
       "  ('siteLat', '45.40136111111111'),\n",
       "  ('siteLong', '11.880069444444445')],\n",
       " [('stepIndexNumber', '11'),\n",
       "  ('siteName', 'Museo del precinema'),\n",
       "  ('siteLat', '45.40001111111111'),\n",
       "  ('siteLong', '11.875761111111112')],\n",
       " [('stepIndexNumber', '12'),\n",
       "  ('siteName', \"Museo dell'Educazione\"),\n",
       "  ('siteLat', '45.40576111111111'),\n",
       "  ('siteLong', '11.873130555555557')],\n",
       " [('stepIndexNumber', '13'), ('siteName', 'Museo di Antropologia (Padova)')],\n",
       " [('stepIndexNumber', '14'),\n",
       "  ('siteName', \"Museo di geografia dell'Università di Padova\"),\n",
       "  ('siteLat', '45.40496944444444'),\n",
       "  ('siteLong', '11.879111111111111')],\n",
       " [('stepIndexNumber', '15'),\n",
       "  ('siteName', \"Museo di storia della fisica dell'Università di Padova\"),\n",
       "  ('siteLat', '45.41043055555556'),\n",
       "  ('siteLong', '11.88576111111111')]]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "tourName = \"Tour 1\"\n",
    "query('''\n",
    "SELECT ?stepIndexNumber ?siteName ?siteLat ?siteLong WHERE {\n",
    "    ?tour a pgt:Tour;\n",
    "          sdo:name \"''' + tourName + '''\";\n",
    "\t      pgt:steps ?stepNode .\n",
    "    ?stepNode ?stepIndex ?site .\n",
    "\n",
    "    FILTER (strstarts(str(?stepIndex), 'http://www.w3.org/1999/02/22-rdf-syntax-ns#_'))\n",
    "\n",
    "    BIND (STRLEN(\"http://www.w3.org/1999/02/22-rdf-syntax-ns#_\") AS ?prefixLength)\n",
    "    BIND (xsd:integer(SUBSTR(xsd:string(?stepIndex),?prefixLength + 1)) AS ?stepIndexNumber).\n",
    "\n",
    "    OPTIONAL{ ?site sdo:name ?siteName. }\n",
    "    OPTIONAL{ ?site geo:lat  ?siteLat.  }\n",
    "    OPTIONAL{ ?site geo:long ?siteLong. }\n",
    "\n",
    "\n",
    "} ORDER BY ?stepIndexNumber\n",
    "\n",
    "''')\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2 - Check for missing information\n",
    "\n",
    "In the previous query, we noticed some data is missing from a bunch of cultural sites. What if we want to check for missing data or orphan nodes?\n",
    "\n",
    "We may do this via sparQL, and use the `UNION` keyword to get all the errors at once."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "184\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('error', 'Missing geo data'), ('entity', 'pgt:SITE63')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE41')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE45')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE13')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE6')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE105')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE106')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE108')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE110')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE112')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE114')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE116')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE117')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE119')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE133')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE134')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE135')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE136')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE137')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE138')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE139')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE145')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE22')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE23')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE25')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE26')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE27')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE31')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE34')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE37')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE50')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE59')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE64')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE65')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE69')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE82')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE85')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITEsq3')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITEsq1')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE63')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE41')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE43')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE45')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE47')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE10')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE11')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE12')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE13')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE14')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE15')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE5')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE6')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE7')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE8')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE9')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE100')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE101')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE102')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE103')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE104')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE105')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE106')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE107')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE108')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE109')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE110')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE111')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE112')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE113')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE114')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE115')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE116')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE117')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE118')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE119')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE120')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE121')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE122')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE123')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE124')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE125')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE126')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE127')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE128')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE129')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE130')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE131')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE132')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE133')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE134')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE135')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE136')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE137')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE138')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE139')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE140')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE141')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE142')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE143')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE144')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE145')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE146')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE147')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE148')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE149')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE16')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE17')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE18')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE19')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE20')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE21')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE22')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE23')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE24')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE25')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE26')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE27')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE28')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE29')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE30')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE31')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE32')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE33')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE34')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE35')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE36')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE37')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE38')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE39')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE40')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE42')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE44')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE46')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE48')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE49')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE50')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE51')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE52')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE53')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE54')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE55')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE56')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE57')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE58')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE59')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE60')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE61')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE62')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE64')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE65')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE66')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE67')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE68')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE69')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE70')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE71')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE72')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE73')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE74')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE75')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE76')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE77')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE78')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE79')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE80')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE81')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE82')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE83')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE84')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE85')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE86')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE87')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE88')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE89')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE90')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE91')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE92')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE93')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE94')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE95')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE96')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE97')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE98')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE99')]]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query('''\n",
    "SELECT DISTINCT ?error ?entity WHERE {\n",
    "\n",
    "\n",
    "    { \n",
    "        SELECT ?error (?site AS ?entity)  WHERE { \n",
    "            BIND( \"Missing geo data\" as ?error)\n",
    "            ?site a pgt:CulturalSite .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?site geo:lat ?lat;\n",
    "                    geo:long ?long.\n",
    "            }\n",
    "        }\n",
    "    } UNION { \n",
    "        SELECT ?error (?site AS ?entity)  WHERE { \n",
    "            BIND( \"Missing CulturalSiteCategory\" as ?error)\n",
    "            ?site a pgt:CulturalSite .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?artwork pgt:hasSite ?site;\n",
    "            }\n",
    "        }\n",
    "    } UNION { \n",
    "        SELECT ?error (?artwork AS ?entity)  WHERE { \n",
    "            BIND( \"Missing CulturalSite\" as ?error)\n",
    "            ?artwork a pgt:Artwork .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?artwork pgt:hasSite ?site;\n",
    "            }\n",
    "        }\n",
    "    } \n",
    "\n",
    "\n",
    "}\n",
    "''')\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 3 - Get meaningful (with coordinates) sites by number of artworks\n",
    "\n",
    "Now we would like to create a new tour. In order to do so, we would like to see which sites have associated artwork, so we may pick meaningful sites.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "12\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('name', 'Palazzina del prefetto (ex)'), ('number', '804')],\n",
       " [('name', 'Convento degli Eremitani'), ('number', '752')],\n",
       " [('name', 'Complesso Cavalli'), ('number', '559')],\n",
       " [('name', 'Palazzo Folco'), ('number', '468')],\n",
       " [('name', \"Museo d'Arte Medievale e Moderna\"), ('number', '358')],\n",
       " [('name', 'Museo archeologico'), ('number', '279')],\n",
       " [('name', 'Palazzo ECA (ex)'), ('number', '179')],\n",
       " [('name', 'Cappella degli Scrovegni'), ('number', '68')],\n",
       " [('name', 'Museo Bottacin'), ('number', '28')],\n",
       " [('name', 'Palazzo Wollemborg'), ('number', '20')],\n",
       " [('name', 'Complesso Ingegneria'), ('number', '10')],\n",
       " [('name', \"Museo del Risorgimento e dell'Età Contemporanea\"),\n",
       "  ('number', '10')]]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query(''' \n",
    "SELECT DISTINCT ?name (COUNT(?artwork) as ?number) WHERE { \n",
    "    ?artwork a pgt:Artwork; \n",
    "            pgt:hasSite ?site. \n",
    "    ?site sdo:name ?name. \n",
    "        FILTER EXISTS {?site geo:lat ?lat} \n",
    "        FILTER EXISTS {?site geo:long ?long} \n",
    " \n",
    "    }   \n",
    "GROUP BY ?name  \n",
    "ORDER BY DESC(?number) \n",
    "LIMIT 100 \n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "As you see, artworks are splitted across very few sites compared to the one we have, which are:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('numberOfCulturalSites', '159')]]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query('''\n",
    "SELECT DISTINCT (COUNT(?site) as ?numberOfCulturalSites) WHERE {\n",
    "    ?site a pgt:CulturalSite;\n",
    "} LIMIT 1\n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This may be explained considering that:\n",
    "- many sites are not museums, but squared or other monuments\n",
    "- many sites do not provide data about their artworks"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 4 - Get sites by distance from a point\n",
    "\n",
    "https://graphdb.ontotext.com/documentation/9.6/free/using-math-functions-with-sparql.html\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "162.42020990254528 m\n",
      "0.7925707878840436 0.7925814053036598 0.20734530906241244 0.20731229325072892 1.0617419616276713e-05 -3.30158116835233e-05\n",
      "162.42020990224358 m\n",
      "1\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('lat1', '0.7925708'),\n",
       "  ('lat2', '0.79258144'),\n",
       "  ('lon1', '0.20734532'),\n",
       "  ('lon2', '0.20731232'),\n",
       "  ('dlat', '1.0609627E-5'),\n",
       "  ('dlon', '-3.3006072E-5'),\n",
       "  ('distance', '162.35992852325901')]]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Python 3 program to calculate Distance Between Two Points on Earth\n",
    "from math import radians, cos, sin, asin, sqrt\n",
    "\n",
    "def distance(lat1, lat2, lon1, lon2):\n",
    "     \n",
    "    # The math module contains a function named\n",
    "    # radians which converts from degrees to radians.\n",
    "    lon1 = radians(lon1)\n",
    "    lon2 = radians(lon2)\n",
    "    lat1 = radians(lat1)\n",
    "    lat2 = radians(lat2)\n",
    "      \n",
    "    # Haversine formula\n",
    "    dlon = lon2 - lon1\n",
    "    dlat = lat2 - lat1\n",
    "    a = sin(dlat / 2)**2 + cos(lat1) * cos(lat2) * sin(dlon / 2)**2\n",
    " \n",
    "    c = 2 * asin(sqrt(a))\n",
    "    \n",
    "    # Radius of earth in kilometers = 6371. Use 3956 for miles\n",
    "    # Since we have small distances, I've changed it to meters\n",
    "    r = 6371 * 1000\n",
    "      \n",
    "    # calculate the result\n",
    "    return(c * r)\n",
    "\n",
    "def distance2(lat1, lat2, lon1, lon2):\n",
    "     \n",
    "    # The math module contains a function named\n",
    "    # radians which converts from degrees to radians.\n",
    "    lon1 = lon1 * 3.14159265359 / 180\n",
    "    lon2 = lon2 * 3.14159265359 / 180\n",
    "    lat1 = lat1 * 3.14159265359 / 180\n",
    "    lat2 = lat2 * 3.14159265359 / 180\n",
    "      \n",
    "\n",
    "    # Haversine formula\n",
    "    dlon = lon2 - lon1\n",
    "    dlat = lat2 - lat1\n",
    "    print(lat1, lat2, lon1, lon2, dlat, dlon)\n",
    "\n",
    "    return 2 * asin(sqrt(sin(dlat / 2)**2 + cos(lat1) * cos(lat2) * sin(dlon / 2)**2)) * 6371 * 1000\n",
    " \n",
    "    \n",
    "    \n",
    "\n",
    "'''\n",
    " [('stepIndexNumber', '2'),\n",
    "  ('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
    "  ('siteLat', '45.41096111111111'),\n",
    "  ('siteLong', '11.880011111111111')],\n",
    " [('stepIndexNumber', '3'),\n",
    "  ('siteName', 'Museo Bottacin'),\n",
    "  ('siteLat', '45.411569444444446'),\n",
    "  ('siteLong', '11.878119444444446')],\n",
    "'''\n",
    "# driver code\n",
    "lat1 = 45.41096111111111\n",
    "lat2 = 45.411569444444446\n",
    "lon1 = 11.880011111111111\n",
    "lon2 =  11.878119444444446\n",
    "print(distance(lat1, lat2, lon1, lon2), \"m\")\n",
    "print(distance2(lat1, lat2, lon1, lon2), \"m\")\n",
    "\n",
    "\n",
    "query('''\n",
    "SELECT DISTINCT ?lat1 ?lat2 ?lon1 ?lon2 ?dlat ?dlon ?distance {\n",
    "    BIND(\"''' + str(lat1) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lat1)\n",
    "    BIND(\"''' + str(lat2) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lat2)\n",
    "    BIND(\"''' + str(lon1) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lon1)\n",
    "    BIND(\"''' + str(lon2) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lon2)\n",
    "    BIND(?lat2 - ?lat1 AS ?dlat)\n",
    "    BIND(?lon2 - ?lon1 AS ?dlon)\n",
    "\n",
    "    BIND(2 * ofn:asin(ofn:sqrt(ofn:sin(?dlat / 2)* ofn:sin(?dlat / 2) + ofn:cos(?lat1) * ofn:cos(?lat2) * ofn:sin(?dlon / 2) * ofn:sin(?dlon / 2))) * 6371 * 1000 AS ?distance)\n",
    "\n",
    "}\n",
    "''')\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "105\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('siteName', 'Cappella degli Scrovegni'), ('distance', '46.1037033728453')],\n",
       " [('siteName', 'Museo archeologico'), ('distance', '67.59393234279999')],\n",
       " [('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('distance', '67.59393234279999')],\n",
       " [('siteName', 'Convento degli Eremitani'),\n",
       "  ('distance', '144.38608405467824')],\n",
       " [('siteName', 'Palazzo Zuckermann'), ('distance', '147.61968528552447')],\n",
       " [('siteName', 'Museo Bottacin'), ('distance', '147.61968528552447')],\n",
       " [('siteName', 'Complesso Cavalli'), ('distance', '157.8335972843654')],\n",
       " [('siteName', 'Palazzo Cavalli alle Porte Contarine'),\n",
       "  ('distance', '159.12098280757957')],\n",
       " [('siteName', 'Porte Contarine'), ('distance', '200.9640879391254')],\n",
       " [('siteName', 'Porta Altinate'), ('distance', '320.81427483311955')],\n",
       " [('siteName', 'Centro culturale Altinate/San Gaetano'),\n",
       "  ('distance', '345.47557984269116')],\n",
       " [('siteName', 'Chiesa di San Gaetano (Padova)'),\n",
       "  ('distance', '383.76138408772346')],\n",
       " [('siteName', 'Chiesa di San Fermo (Padova)'),\n",
       "  ('distance', '385.72263485422246')],\n",
       " [('siteName', \"Chiesa di Sant'Andrea (Padova)\"),\n",
       "  ('distance', '421.2074001837105')],\n",
       " [('siteName', \"Gatta di Sant'Andrea\"), ('distance', '435.1936794167633')],\n",
       " [('siteName', 'Scuola del Carmine'), ('distance', '462.63046530677985')],\n",
       " [('siteName', \"Museo di storia della fisica dell'Università di Padova\"),\n",
       "  ('distance', '466.3339553578984')],\n",
       " [('siteName', 'Caffè Pedrocchi'), ('distance', '474.76635923549196')],\n",
       " [('siteName', \"Museo del Risorgimento e dell'Età Contemporanea\"),\n",
       "  ('distance', '478.9320272987948')],\n",
       " [('siteName', 'Chiesa di Santa Lucia (Padova)'),\n",
       "  ('distance', '481.12863902491733')],\n",
       " [('siteName', 'Scuola di San Rocco (Padova)'),\n",
       "  ('distance', '483.36168000288666')],\n",
       " [('siteName', 'Ponte Molino'), ('distance', '488.9607692549007')],\n",
       " [('siteName', 'Porta Molino'), ('distance', '493.36086393807267')],\n",
       " [('siteName', 'Basilica del Carmine (Padova)'),\n",
       "  ('distance', '496.1177237374017')],\n",
       " [('siteName', 'Palazzo Folco'), ('distance', '538.9359074541471')],\n",
       " [('siteName', 'Tempio della Pace (Padova)'),\n",
       "  ('distance', '569.125508329447')],\n",
       " [('siteName', 'Palazzo del Bo'), ('distance', '576.121986835045')],\n",
       " [('siteName', 'Palazzo del Monte di Pietà Vecchio'),\n",
       "  ('distance', '579.5053123757905')],\n",
       " [('siteName', 'Palazzo Maldura'), ('distance', '585.8234772569133')],\n",
       " [('siteName', 'Palazzo Comunale (Padova)'),\n",
       "  ('distance', '586.3663700642029')],\n",
       " [('siteName', 'Chiesa di Santa Sofia (Padova)'),\n",
       "  ('distance', '603.2706140100445')],\n",
       " [('siteName', 'Palazzo della Ragione (Padova)'),\n",
       "  ('distance', '608.4922042248435')],\n",
       " [('siteName', 'Palazzo Zabarella'), ('distance', '623.6318232827416')],\n",
       " [('siteName', 'Ponte di San Lorenzo'), ('distance', '629.793676548392')],\n",
       " [('siteName', 'Chiesa di San Clemente (Padova)'),\n",
       "  ('distance', '634.5946703230164')],\n",
       " [('siteName', 'Chiesa di San Canziano (Padova)'),\n",
       "  ('distance', '646.5263948454124')],\n",
       " [('siteName', 'Palazzo delle Debite'), ('distance', '651.5718290762179')],\n",
       " [('siteName', 'Tomba di Antenore'), ('distance', '655.983666636137')],\n",
       " [('siteName', 'Chiesa di San Nicolò (Padova)'),\n",
       "  ('distance', '662.3878345241047')],\n",
       " [('siteName', 'Chiesa di Santa Margherita (Padova)'),\n",
       "  ('distance', '694.4221540228286')],\n",
       " [('siteName', 'MUSME'), ('distance', '702.2258131831054')],\n",
       " [('siteName', 'Ospedale di San Francesco Grande'),\n",
       "  ('distance', '702.2258131831054')],\n",
       " [('siteName', \"Torre dell'Orologio (Padova)\"),\n",
       "  ('distance', '704.8480489531662')],\n",
       " [('siteName', 'Mura di Padova'), ('distance', '705.5827857525393')],\n",
       " [('siteName', 'Chiesa del Beato Antonio Pellegrino'),\n",
       "  ('distance', '709.3486997652653')],\n",
       " [('siteName', 'Complesso Ingegneria'), ('distance', '710.1187026601551')],\n",
       " [('siteName', \"Chiesa di Sant'Eufemia (Padova)\"),\n",
       "  ('distance', '714.8771805011403')],\n",
       " [('siteName', 'Sinagoga di Padova di rito italiano'),\n",
       "  ('distance', '730.2332418671696')],\n",
       " [('siteName', \"Museo di geografia dell'Università di Padova\"),\n",
       "  ('distance', '737.3998509032723')],\n",
       " [('siteName', 'Palazzo Wollemborg'), ('distance', '743.5927892308702')],\n",
       " [('siteName', 'Chiesa di San Francesco Grande (Padova)'),\n",
       "  ('distance', '748.3085156278748')],\n",
       " [('siteName', 'Palazzo del Monte di Pietà Nuovo'),\n",
       "  ('distance', '769.1871478666558')],\n",
       " [('siteName', 'Sala dei Giganti (Padova)'), ('distance', '773.122520136015')],\n",
       " [('siteName', 'Palazzo Liviano'), ('distance', '789.8558249041774')],\n",
       " [('siteName', 'Museo diocesano (Padova)'), ('distance', '796.6991218779372')],\n",
       " [('siteName', 'Arco Valaresso'), ('distance', '804.6619376418193')],\n",
       " [('siteName', 'Loggia dei Carraresi'), ('distance', '825.6988726025962')],\n",
       " [('siteName', 'Battistero di Padova'), ('distance', '832.0115456317573')],\n",
       " [('siteName', 'Palazzo ECA (ex)'), ('distance', '837.2815827479159')],\n",
       " [('siteName', \"Museo dell'Educazione\"), ('distance', '840.0831394334747')],\n",
       " [('siteName', 'Chiesa di Santa Maria dei Servi (Padova)'),\n",
       "  ('distance', '842.0149334388736')],\n",
       " [('siteName', 'Museo di anatomia patologica (Padova)'),\n",
       "  ('distance', '860.6303912889346')],\n",
       " [('siteName', \"Chiesa dell'Immacolata (Padova)\"),\n",
       "  ('distance', '870.9190229122064')],\n",
       " [('siteName', 'Chiesa di Santa Caterina (Padova)'),\n",
       "  ('distance', '870.9742611815559')],\n",
       " [('siteName', 'Duomo di Padova'), ('distance', '905.7853435042784')],\n",
       " [('siteName', 'Chiesa di San Pietro Apostolo (Padova)'),\n",
       "  ('distance', '932.7082057505356')],\n",
       " [('siteName', \"Chiesa di Sant'Antonio di Vienna\"),\n",
       "  ('distance', '934.1767088169231')],\n",
       " [('siteName', 'Chiesa di San Benedetto Vecchio'),\n",
       "  ('distance', '1032.971000283856')],\n",
       " [('siteName', 'Loggia e Odeo Cornaro'), ('distance', '1052.5258846177153')],\n",
       " [('siteName', 'Chiesa di San Benedetto Novello'),\n",
       "  ('distance', '1056.542791243528')],\n",
       " [('siteName', 'Palazzo Mussato'), ('distance', '1060.6911998232968')],\n",
       " [('siteName', 'Palazzo Pisani de Lazzara'),\n",
       "  ('distance', '1061.880159905903')],\n",
       " [('siteName', 'Monumento equestre al Gattamelata'),\n",
       "  ('distance', '1132.2325997720432')],\n",
       " [('siteName', 'Museo antoniano'), ('distance', '1135.435478252382')],\n",
       " [('siteName', \"Basilica di Sant'Antonio di Padova\"),\n",
       "  ('distance', '1136.646422247902')],\n",
       " [('siteName', 'Oratorio di San Giorgio (Padova)'),\n",
       "  ('distance', '1167.4945388881779')],\n",
       " [('siteName', 'Palazzo Capodilista'), ('distance', '1181.58915862698')],\n",
       " [('siteName', 'Chiesa di San Massimo (Padova)'),\n",
       "  ('distance', '1186.1991701912905')],\n",
       " [('siteName', 'Porta Savonarola'), ('distance', '1192.9587820654192')],\n",
       " [('siteName', 'Chiesa di San Daniele (Padova)'),\n",
       "  ('distance', '1207.0088431809218')],\n",
       " [('siteName', \"Santuario dell'Arcella\"), ('distance', '1226.3172488829225')],\n",
       " [('siteName', 'Chiesa di San Tomaso Cantuariense (Padova)'),\n",
       "  ('distance', '1268.681993391505')],\n",
       " [('siteName', 'Chiesa di Santa Maria in Vanzo'),\n",
       "  ('distance', '1287.77459045358')],\n",
       " [('siteName', 'Castelvecchio (Padova)'), ('distance', '1303.8338871350618')],\n",
       " [('siteName', 'Chiesa di San Prosdocimo (Padova)'),\n",
       "  ('distance', '1303.919555210438')],\n",
       " [('siteName', 'Palazzo Angeli (Padova)'), ('distance', '1313.2538172832112')],\n",
       " [('siteName', 'Museo del precinema'), ('distance', '1327.2041203270603')],\n",
       " [('siteName', 'Palazzina del prefetto (ex)'),\n",
       "  ('distance', '1333.659938708827')],\n",
       " [('siteName', 'Chiesa di Ognissanti (Padova)'),\n",
       "  ('distance', '1376.683844914645')],\n",
       " [('siteName', 'Chiesa di Santa Maria del Torresino'),\n",
       "  ('distance', '1387.5482859342253')],\n",
       " [('siteName', 'Specola di Padova'), ('distance', '1393.7340841620553')],\n",
       " [('siteName', 'Oratorio di San Michele (Padova)'),\n",
       "  ('distance', '1420.9838042932233')],\n",
       " [('siteName', 'Porta San Giovanni (Padova)'),\n",
       "  ('distance', '1427.0171596723155')],\n",
       " [('siteName', 'Loggia Amulea'), ('distance', '1433.6225599027305')],\n",
       " [('siteName', 'Chiesa delle Dimesse'), ('distance', '1513.1936205188306')],\n",
       " [('siteName', 'Palazzo Grimani (Padova)'), ('distance', '1608.626629061492')],\n",
       " [('siteName', 'Chiesa di Santa Maria delle Grazie (Padova)'),\n",
       "  ('distance', '1617.019958945723')],\n",
       " [('siteName', 'Basilica di Santa Giustina'),\n",
       "  ('distance', '1688.4797073590457')],\n",
       " [('siteName', 'Muro di Padova'), ('distance', '1890.2772156094343')],\n",
       " [('siteName', 'Chiesa di San Carlo Borromeo (Padova)'),\n",
       "  ('distance', '2061.561117902353')],\n",
       " [('siteName', 'Scuola del Redentore'), ('distance', '2147.2318945766556')],\n",
       " [('siteName', 'Chiesa di Santa Croce (Padova)'),\n",
       "  ('distance', '2173.9432972461836')],\n",
       " [('siteName', 'Santuario di San Leopoldo Mandic'),\n",
       "  ('distance', '2212.66128926689')],\n",
       " [('siteName', 'Cimitero Maggiore (Padova)'),\n",
       "  ('distance', '2448.900146760721')],\n",
       " [('siteName', \"Tempio nazionale dell'internato ignoto\"),\n",
       "  ('distance', '2887.9788235602605')]]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "lat = 45.411569444444446\n",
    "lon = 11.880011111111111\n",
    "maxDistance = 3000 # meters\n",
    "\n",
    "query('''\n",
    "SELECT DISTINCT ?siteName ?distance {\n",
    "    BIND(\"''' + str(lat) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lat1)\n",
    "    BIND(\"''' + str(lon) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lon1)\n",
    "\n",
    "    ?site a pgt:CulturalSite .\n",
    "    ?site sdo:name ?siteName .\n",
    "\n",
    "    ?site geo:lat  ?lat2deg .\n",
    "    ?site geo:long ?lon2deg .\n",
    "\n",
    "\n",
    "    BIND(?lat2deg * 3.14159265359 / 180 as ?lat2)\n",
    "    BIND(?lon2deg * 3.14159265359 / 180 as ?lon2)\n",
    "    BIND(?lat2 - ?lat1 AS ?dlat)\n",
    "    BIND(?lon2 - ?lon1 AS ?dlon)\n",
    "\n",
    "    BIND(2 * ofn:asin(ofn:sqrt(ofn:sin(?dlat / 2)* ofn:sin(?dlat / 2) + ofn:cos(?lat1) * ofn:cos(?lat2) * ofn:sin(?dlon / 2) * ofn:sin(?dlon / 2))) * 6371 * 1000 AS ?distance)\n",
    "\n",
    "    FILTER(?distance < \"''' + str(maxDistance) + '''\"^^xsd:float).\n",
    "}ORDER BY ?distance LIMIT 1000\n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 5 - Get the tallest artwork made by each author"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "100\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   '5 diamanti; oro; rubino ottagonale; 2 smeraldi ottagonali; taglio a rosetta')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   '6 diamanti; oro; 4 rubini; smalto nero; smalto trasparente rosso-arancio; turchese; sfaccettatura; smaltatura; taglio a rosetta')],\n",
       " [('site', 'pgt:SITE3'), ('material', 'ARGENTO; CONIAZIONE')],\n",
       " [('site', 'pgt:SITE3'), ('material', 'ARGENTO; FUSIONE')],\n",
       " [('site', 'pgt:SITE0'), ('material', 'Affresco')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Agata a due strati, avori, grigio / incisione')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material',\n",
       "   'Agata a tre strati, grigia, marrone pallido, marrone scuro / incisione')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material',\n",
       "   'Agata a tre strati, grigio molto pallido, marrone scuro / incisione')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material', 'Agata corniola ovale; oro; taglio a piastra')],\n",
       " [('site', 'pgt:SITE1'), ('material', 'Agata semiopaca, zonata / incisione')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Agata-diaspro blu con inclusioni di calcite / incisione')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Agata-onice nera con banda bianca / incisione')],\n",
       " [('site', 'pgt:SITE2'), ('material', 'Altorilievo in marmo bianco')],\n",
       " [('site', 'pgt:SITE1'), ('material', 'Ametista / incisione')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Argento dorato; metallo dorato; radica; rame dorato; smalto; tartaruga; vetro')],\n",
       " [('site', 'pgt:SITE3'), ('material', 'Argento, coniazione')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Argento; carta; castoni; foglia metallica; osso; parti vitree; litografia')],\n",
       " [('site', 'pgt:SITE2'), ('material', 'Argento; carta; marmo; vetro; guazzo')],\n",
       " [('site', 'pgt:SITE2'), ('material', 'Argento; cesellatura')],\n",
       " [('site', 'pgt:SITE2'), ('material', 'Argento; cesello; niello')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material', 'Argento; oro; tartaruga; piqué incrusté')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Argilla, sagomatura e cottura in forno')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Argilla, tornio, incisione e cottura in forno')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Avorio; carta; madreperla; ottone; tartaruga; acquarello; incisione')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material', 'Avorio; legno di ebano; legno di mogano')],\n",
       " [('site', 'pgt:SITE2'), ('material', 'Avorio; legno; intaglio')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material', 'Avorio; legno; metallo dorato; tartaruga; bassorilievo')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Avorio; legno; ottone; tartaruga; velluto; vetro; bassorilievo')],\n",
       " [('site', 'pgt:SITE2'), ('material', 'Avorio; legno; rilievo')],\n",
       " [('site', 'pgt:SITE2'), ('material', 'Avorio; madreperla; metallo dorato')],\n",
       " [('site', 'pgt:SITE2'), ('material', 'Avorio; rilievo')],\n",
       " [('site', 'pgt:SITE3'), ('material', 'BRONZO; CONIAZIONE')],\n",
       " [('site', 'pgt:SITE3'), ('material', 'BRONZO; FUSIONE')],\n",
       " [('site', 'pgt:SITE2'), ('material', 'Bassorilievo in marmo')],\n",
       " [('site', 'pgt:SITE2'), ('material', 'Bassorilievo in marmo bianco')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Bronzo / fusione con rifiniture a bulino')],\n",
       " [('site', 'pgt:SITE1'), ('material', 'Bronzo / fusione e cesellatura')],\n",
       " [('site', 'pgt:SITE1'), ('material', 'Bronzo / fusione piena')],\n",
       " [('site', 'pgt:SITE1'), ('material', 'Bronzo / fusione piena / incisione')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Bronzo / fusione piena con rifinitura a bulino')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Bronzo / fusione piena con rifiniture a bulino')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material',\n",
       "   'Bronzo / fusione piena con rifiniture a bulino e tracce di limatura')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Bronzo / fusione piena con rifiniture in argento a bulino')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Bronzo a fusione cava / rifiniture a bulino')],\n",
       " [('site', 'pgt:SITE1'), ('material', 'Bronzo a fusione piena')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Bronzo a fusione piena/ incisioni a bulino.')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Bronzo a martellatura con rifiniture a bulino')],\n",
       " [('site', 'pgt:SITE1'), ('material', 'Bronzo fuso')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material', 'Bronzo patinato (patina bruno scura); tutto tondo')],\n",
       " [('site', 'pgt:SITE1'), ('material', 'Bronzo/ fusione')],\n",
       " [('site', 'pgt:SITE1'), ('material', 'Bronzo/ fusione a stampo')],\n",
       " [('site', 'pgt:SITE1'), ('material', 'Bronzo/ fusione a stampo trivalve')],\n",
       " [('site', 'pgt:SITE1'), ('material', 'Bronzo/ fusione piena')],\n",
       " [('site', 'pgt:SITE1'), ('material', 'Bronzo/ fusione piena/ incisione')],\n",
       " [('site', 'pgt:SITE3'), ('material', 'CARTA; ACQUERELLO')],\n",
       " [('site', 'pgt:SITE3'), ('material', 'CARTONE E TELA; OLIO')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Calcare / scultura a bassorilievo e incisione')],\n",
       " [('site', 'pgt:SITE1'), ('material', 'Calcare / scultura e incisione')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material',\n",
       "   'Calcare / scultura e incisione, con uso di trapano corrente e scalpello')],\n",
       " [('site', 'pgt:SITE2'), ('material', 'Calcare compatto; tutto tondo')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material',\n",
       "   'Calcare dei colli Berici / scultura a bassorilievo e incisione')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Calcare di Costozza, bassorilievo, incisione')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material',\n",
       "   'Calcare grigio di Verona / scultura a bassorilievo e incisione')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Calcare istriano / scultura e incisione')],\n",
       " [('site', 'pgt:SITE1'), ('material', 'Calcare/ incisione')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Calcedonio a due strati, arancione, bianco / incisione')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Calcedonio a due strati, bianco, grigio / incisione')],\n",
       " [('site', 'pgt:SITE1'), ('material', 'Calcedonio bianco / incisione')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Calcedonio giallo pallido screziato / incisione')],\n",
       " [('site', 'pgt:SITE1'),\n",
       "  ('material', 'Calco di lastra originariamente in marmo')],\n",
       " [('site', 'pgt:SITE4'), ('material', 'Carta, litografia')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material', 'Carta; cartapesta; legno; madreperla; ottone; litografia')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material', 'Carta; foglia metallica; madreperla; acquarello; tempera')],\n",
       " [('site', 'pgt:SITE4'), ('material', 'Carta; fotografia')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Carta; madreperla; foglia metallica; ottone; pelle; acquarello')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material', 'Carta; madreperla; metallo; incisione; tempera')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material', 'Carta; madreperla; osso; ottone; seta')],\n",
       " [('site', 'pgt:SITE4'), ('material', 'Carta; stampa')],\n",
       " [('site', 'pgt:SITE2'), ('material', 'Carta; tartaruga')],\n",
       " [('site', 'pgt:SITE2'), ('material', 'Ceramica')],\n",
       " [('site', 'pgt:SITE1'), ('material', 'Ceramica a figure rosse')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Ceramica arancio ingobbiata, graffita a punta, invetriata e dipinta; colori: giallo ferraccia, verde ramina')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Ceramica arancio ingobbiata, graffita a punta, invetriata e dipinta; colori: giallo ferraccia, verde ramina, viola di manganese')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Ceramica arancio ingobbiata, graffita, dipinta e invetriata; colori: giallo ferraccia, verde ramina')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Ceramica arancio invetriata; colori: giallo ferraccia, verde ramina, viola di manganese, azzurro di cobalto, giallo di antimonio')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Ceramica arancio scuro invetriata; colori: giallo ferraccia, verde ramina')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Ceramica arancio-rosata ingobbiata, graffita a punta, invetriata e dipinta; colori: giallo ferraccia, verde ramina')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Ceramica giallo rosata ingobbiata, graffita a punta, invetriata e dipinta; colori: giallo ferraccia, verde ramina')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Ceramica giallo-rosata ingobbiata, graffita a punta, invetriata e dipinta; colori: giallo ferraccia, verde ramina')],\n",
       " [('site', 'pgt:SITE2'), ('material', 'Ceramica graffita')],\n",
       " [('site', 'pgt:SITE2'), ('material', 'Ceramica graffita a punta e stecca')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material', 'Ceramica ingobbiata, graffita a punta, invetriata e dipinta')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Ceramica ingobbiata, graffita a punta, invetriata e dipinta; colori: giallo ferraccia, verde ramina')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material', 'Ceramica ingobbiata, graffita e invetriata')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material', 'Ceramica ingobbiata, graffita, invetriata e dipinta')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Ceramica invetriata in nero e successivamente dipinta e dorata a freddo')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Ceramica rosata ingobbiata, graffita a punta, invetriata e dipinta')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Ceramica rosata ingobbiata, graffita a punta, invetriata e dipinta; colore: giallo ferraccia, verde ramina')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Ceramica rosata ingobbiata, graffita a punta, invetriata e dipinta; colori: giallo ferraccia, verde ramina')],\n",
       " [('site', 'pgt:SITE2'),\n",
       "  ('material',\n",
       "   'Ceramica rosata invetriata; colori: giallo ferraccia, verde ramina')]]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query(''' \n",
    "SELECT DISTINCT ?author ?artworkName ?height WHERE { \n",
    "    ?artwork a pgt:Artwork; \n",
    "             sdo:author ?author; \n",
    "             pgt:height ?height. \n",
    "    FILTER (?height=?maxHeight && ?author = ?Innerauthor) \n",
    "    { \n",
    " \n",
    "        SELECT ?Innerauthor (MAX(?height) AS ?maxHeight) WHERE { \n",
    "                ?artwork a pgt:Artwork; \n",
    "                        sdo:author ?Innerauthor;  \n",
    "                        pgt:height ?height. \n",
    "        }  \n",
    "        GROUP BY (?Innerauthor) \n",
    "    } \n",
    "} \n",
    " \n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 6 - Generate a new tour\n",
    "\n",
    "This query will generate a tour given the name, description and visited sites (as a list of names of cultural sites).\n",
    "\n",
    "This is more a proof of concept than an actual useful query, since it would make way more sense to use a programming language to generate part of the query (for example, the UUID could be generated in Python instead) instead of a pure sparQL call.\n",
    "\n",
    "You may safely run this query multiple times: thanks to the `BIND` + `MINUS` keywords, the insertion is skipped if a tour with the same name already exists.\n",
    "\n",
    "*NOTE*: GraphDB requires a different endpoint for `INSERT` queries, thus we had to write a different function to handle inserts from the Notebook"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "b''"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "tourName = \"Generated Tour\"\n",
    "tourDescription = \"Description of generated tour\"\n",
    "\n",
    "# It would be nice to avoid manual index assigning of sites' indexes,\n",
    "# however, this is not possible, since sparQL lists are always unordered ones.\n",
    "tourSteps = '''\n",
    "    (1 \"Chiesa di San Bonaventura delle Eremite\")\n",
    "    (2 \"Battistero di Padova\")\n",
    "'''\n",
    "\n",
    "insertQuery('''\n",
    "INSERT { \n",
    "    ?tourID a pgt:Tour.\n",
    "    ?tourStepsID a rdf:Seq.\n",
    "\n",
    "    ?tourID pgt:steps ?tourStepsID.\n",
    "    ?tourID sdo:name ?tourName.\n",
    "    ?tourID sdo:description ?tourDescription.\n",
    "    \n",
    "    ?tourStepsID ?isStep ?stepSite.\n",
    "\n",
    "} WHERE { \n",
    "    BIND(\"'''+ tourName + '''\" as ?tourName).\n",
    "    BIND(\"'''+ tourDescription + '''\" as ?tourDescription).\n",
    "    MINUS { \n",
    "        ?checkingTour a pgt:Tour;\n",
    "           sdo:name ?tourName.\n",
    "    }.\n",
    "    BIND(StrUUID() AS ?uuidCode) . \n",
    "    BIND(URI(CONCAT(\"https://padovagrandtour.github.io/entities#TOUR-\", ?uuidCode)) AS ?tourID).\n",
    "    BIND(URI(CONCAT(\"https://padovagrandtour.github.io/entities#TOURSTEPS-\", ?uuidCode)) AS ?tourStepsID).\n",
    "    \n",
    "    \n",
    "    VALUES (?stepIndex ?stepName) {'''\n",
    "        + tourSteps +\n",
    "    '''}\n",
    "    \n",
    "    BIND(URI(CONCAT(\"http://www.w3.org/1999/02/22-rdf-syntax-ns#_\", STR(?stepIndex))) AS ?isStep).\n",
    "    ?stepSite a pgt:CulturalSite;\n",
    "          sdo:name ?stepName.\n",
    "\n",
    "\n",
    "\n",
    "}\n",
    "\n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 7 - Get a tour preview\n",
    "\n",
    "Getting some random artworks of what we are going to see in the newly generated tour."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Empty\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query('''\n",
    "SELECT ?siteName ?artworkName ?artworkDescription ?artworkImage ?artworkURL WHERE {\n",
    "    ?tour a pgt:Tour;\n",
    "          sdo:name \"'''+ tourName + '''\";\n",
    "\t      pgt:steps ?stepNode .\n",
    "          \n",
    "    ?stepNode ?stepIndex ?site .\n",
    "    FILTER (strstarts(str(?stepIndex), 'http://www.w3.org/1999/02/22-rdf-syntax-ns#_'))\n",
    "\n",
    "\n",
    "    ?site sdo:name ?siteName .\n",
    "\n",
    "    ?artwork pgt:hasSite ?site;\n",
    "             sdo:image ?artworkImage;\n",
    "             sdo:name ?artworkName;\n",
    "             sdo:url ?artworkURL;\n",
    "             sdo:description ?artworkDescription.\n",
    "\n",
    "} ORDER BY RAND() LIMIT 10\n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 8 - Get tour recap/metrics\n",
    "\n",
    "In this query we get some metrics about the whole tour, such as the total travelled distance and the average year of the artwork we are going to see.\n",
    "First part of the query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query('''\n",
    "\n",
    "\n",
    "SELECT  ?distance ?site1 ?site2 WHERE {\n",
    "    ?tour a pgt:Tour ;\n",
    "          sdo:name \"Tour 1\" ;\n",
    "\t      pgt:steps ?stepNode .\n",
    "          \n",
    "    ?stepNode ?stepIndex ?startPoint ;\n",
    "              ?stepIndex ?endPoint .\n",
    "    FILTER (strstarts(str(?stepIndex), 'http://www.w3.org/1999/02/22-rdf-syntax-ns#_'))\n",
    "\n",
    "    ?startPoint a pgt:CulturalSite ;\n",
    "             sdo:name ?site1 ;\n",
    "             geo:lat  ?lat1deg ;\n",
    "             geo:lat  ?lon1deg .\n",
    "\n",
    "    ?site2   geo:lat  ?lat2deg ;\n",
    "             geo:lat  ?lon2deg .\n",
    "\n",
    "    BIND(?lat1deg * 3.14159265359 / 180 as ?lat1)\n",
    "    BIND(?lon1deg * 3.14159265359 / 180 as ?lon1)\n",
    "    BIND(?lat2deg * 3.14159265359 / 180 as ?lat2)\n",
    "    BIND(?lon2deg * 3.14159265359 / 180 as ?lon2)\n",
    "    BIND(?lat2 - ?lat1 AS ?dlat)\n",
    "    BIND(?lon2 - ?lon1 AS ?dlon)\n",
    "\n",
    "    BIND(2 * ofn:asin(ofn:sqrt(ofn:sin(?dlat / 2)* ofn:sin(?dlat / 2) + ofn:cos(?lat1) * ofn:cos(?lat2) * ofn:sin(?dlon / 2) * ofn:sin(?dlon / 2))) * 6371 * 1000 AS ?distance)\n",
    "\n",
    "    SELECT ?site2 {\n",
    "        ?stepNode ?stepIndex ?EndPoint .\n",
    "        FILTER (strstarts(str(?stepIndex), 'http://www.w3.org/1999/02/22-rdf-syntax-ns#_'))\n",
    "\n",
    "        ?endPoint a pgt:CulturalSite ;\n",
    "                sdo:name ?site2 ;\n",
    "    } \n",
    "} FILTER \n",
    "''') "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "2nd part of the query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query('''\n",
    "SELECT ?year  WHERE {\n",
    "    ?tour a pgt:Tour ;\n",
    "          sdo:name \"Tour 1\" ;\n",
    "\t        pgt:steps ?stepNode .\n",
    "          \n",
    "    ?stepNode ?stepIndex ?site .\n",
    "    FILTER (strstarts(str(?stepIndex), 'http://www.w3.org/1999/02/22-rdf-syntax-ns#_'))\n",
    "    \n",
    "    ?artwork pgt:hasSite ?site ;\n",
    "             pgt:yearCreatedText ?year ;\n",
    "  } LIMIT 100\n",
    "''') "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 9 - Get cultural sites which have more than 50 artworks in poor state, displaying these artworks names"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('site', 'pgt:SITE1'),\n",
       "  ('artwork_count', '95'),\n",
       "  ('artwork_names',\n",
       "   \"Kouros, Guerriero in assalto, Guerriero in assalto, Kore, Ercole in assalto, Guerriero in assalto, Ercole in assalto, Ercole in assalto, Kore, Ercole in assalto, Kore, Ercole in assalto, Guerriero a cavallo, Orante, Ercole in assalto, Cavaliere, Orante, Apollo con patera, Cavaliere, Viaggio agli Inferi, Scena di commiato, Uccelli su albero, Fannii, Bollo CARTORIAN, Ratto di Ganimede, Bollo CARTORIAN, Motivi geometrici e fitomorfi, Sileno, Venere che si toglie il sandalo, Iscrizione di Marco Arrunzio Aquila, Atto evergetico di Allenius Strabo, Statua femminile acefala, Giove tonante, Mercurio, Iscrizione di Tilonia Musice, Iscrizione, Iscrizione Rutilius Regillus e Lucius Porcius Germanus, Iscrizione di C. Arrius Optatus, A scorrimento con testa ad anello, Iscrizione, Iscrizione di Quinto Satrio Severo, Iscritta, Bollo CLAVD PANSI, Ritratto femminile, Due busti e un bambino, Iscrizione di Q. Pomponius Severus, Ritratto femminile, Augusto, Livia, Iscrizione Q. Valerius C.f. Silo, Ritratto maschile, Piede umano destro, Busto maschile, Iscrizione beneagurante, Tito Iestino Augurino, Purricina e Iuvenis, Tipo a scorrimento con impugnatura, Bilancia pesa monete, Iscrizione di Gaio Asconio Sardo, Ritratto maschile, A cruna singola, Asclepio (?), Tubolare, a corpo quasi cilindrico, Iscrizione di C. Cluentius Proculus, Asclepio, Uomo seduto e giovinetto stante, Scena di banchetto, Figura femminile nell'atto di incedere, Cavaliere, Scena di sacrificio, Fanciullo che tiene un oggetto tra le mani, Tre menadi danzanti, Tre menadi danzanti, Scena di sacrificio, Hermes, Dioniso, Fauno, Pan, Dioniso e satiro, Testa femminile, Doroteo e Nice, Due Cupidi in lotta, Guerriero, Cavallino, Venere, Mercurio, Offerente con diadema, Offerente armato, Devoto offerente con testa coronata, Kouros, Devoto offerente con testa coronata, Venere pudica, Kouros, Kouros offerente, Figura umana\")]]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "\n",
    "query('''  \n",
    "    SELECT ?site (COUNT(?artwork) AS ?artwork_count)   \n",
    "    (GROUP_CONCAT(?artwork_name; SEPARATOR=\", \") AS ?artwork_names)  \n",
    "  \n",
    "    WHERE {  \n",
    "      ?site a pgt:CulturalSite .  \n",
    "      ?artwork pgt:hasSite ?site.  \n",
    "      ?artwork sdo:name ?artwork_name.  \n",
    "      ?artwork pgt:conservationState \"Mutilo\"^^xsd:string .  \n",
    "    }   \n",
    "    GROUP BY (?site) HAVING( ?artwork_count > 50 )  \n",
    "    ORDER BY DESC (?artwork_count)  \n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 10 -Authors that painted the biggest paintings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('author', 'Jacopo Negretti detto Palma il Giovane'),\n",
       "  ('paintingName',\n",
       "   'Dipinto celebrativo dei rettori Jacopo e Giovanni Soranzo'),\n",
       "  ('surface', '128760.0')],\n",
       " [('author', 'Girolamo da Romano detto Romanino'),\n",
       "  ('paintingName',\n",
       "   'Madonna con il Bambino e i santi Benedetto, Giustina, Prosdocimo e Scolastica\\ncimasa: Pietà\\ntondi: san Luca, san Mattia, san Massimo e san Giuliano da Padova e tre santi martiri innocenti'),\n",
       "  ('surface', '104800.0')],\n",
       " [('author', 'Giambattista Tiepolo'),\n",
       "  ('paintingName', \"San Patrizio vescovo d'Irlanda\"),\n",
       "  ('surface', '56088.0')],\n",
       " [('author', 'Giambattista Piazzetta'),\n",
       "  ('paintingName', 'Cena in Emmaus'),\n",
       "  ('surface', '55692.0')],\n",
       " [('author', 'Jacopo Robusti detto Tintoretto'),\n",
       "  ('paintingName', 'Crocifissione'),\n",
       "  ('surface', '53530.0')],\n",
       " [('author', 'Ludovico Gallina'),\n",
       "  ('paintingName', 'Ritratto del doge Paolo Renier'),\n",
       "  ('surface', '45264.0')],\n",
       " [('author', 'Giotto'), ('paintingName', 'Croce'), ('surface', '36572.0')],\n",
       " [('author', 'Giambettino Cignaroli'),\n",
       "  ('paintingName', 'Ritratto di Giovanni Bragadin, patriarca di Venezia'),\n",
       "  ('surface', '32340.0')],\n",
       " [('author', 'Alessandro Longhi'),\n",
       "  ('paintingName',\n",
       "   'Ritratto di Antonio Renier, provveditore generale in Dalmazia e Albania'),\n",
       "  ('surface', '31921.0')],\n",
       " [('author', 'Sebastiano Mazzoni'),\n",
       "  ('paintingName', 'Ritratto di capitano veneziano'),\n",
       "  ('surface', '27872.0')]]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query(''' \n",
    "SELECT ?author ?paintingName (?height*?width as ?surface) \n",
    "WHERE { \n",
    "    ?artwork a pgt:Artwork; \n",
    "            sdo:author ?author; \n",
    "            sdo:name ?paintingName; \n",
    "            pgt:tag ?tag; \n",
    "            pgt:height ?height; \n",
    "            pgt:width ?width. \n",
    "    FILTER(REGEX(?tag,\"dipinto\")) \n",
    "} \n",
    "ORDER BY DESC(?surface) \n",
    "LIMIT 10 \n",
    "''')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.8 64-bit (microsoft store)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.8"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "8708b50ad9c0a509e9badbb56379b21be64fc3341882928e3760492641b8c79c"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
