{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Padova Grand Tour - Queries\n",
    "\n",
    "This notebook will provide ten insightful queries about our data. Get started by running GraphDB with `docker compose up --force-recreate`.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Sparql wrapper (copy, pasted and adapted from the Individual Project's notebooks):"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "# Taken from `data/ttlData/ontology.ttl`\n",
    "# + the ofn prefix, mandatory for math operations in GraphDB\n",
    "prefixString = \"\"\"\n",
    "PREFIX ofn: <http://www.ontotext.com/sparql/functions/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#> \n",
    "PREFIX pgt: <https://padovagrandtour.github.io/entities#> \n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace> \n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> \n",
    "PREFIX sdo: <https://schema.org/>\n",
    "PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    # Our local endpoint, the repo name is defined in `data/graphdb-repo.ttl` \n",
    "    sparql = SPARQLWrapper(\"http://localhost:7210/repositories/pgt\") \n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            array.append(app)\n",
    "        print(\"number of query results = \", len(array)) # Print the array length\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Improved version that also handles prefixes\n",
    "mappedPrefixes = {}\n",
    "for prefix in prefixString.split('\\n'):\n",
    "    if('PREFIX' in prefix):\n",
    "        prefix = prefix.replace('PREFIX', '', 1).split(':', 1)\n",
    "        mappedPrefixes[prefix[0].strip()] = prefix[1].strip().replace('<','').replace('>','')\n",
    "\n",
    "def query(queryString, replacePrefixes=True):\n",
    "    queryResults = run_query(queryString)\n",
    "    if(replacePrefixes):\n",
    "        for queryIndex, queryResultRaw in enumerate(queryResults):\n",
    "            for subQueryIndex, subQueryResultRaw in enumerate(queryResultRaw):\n",
    "                queryResult = queryResultRaw[subQueryIndex][1]\n",
    "                for prefixName, prefixValue in mappedPrefixes.items():\n",
    "                    queryResult = queryResult.replace(prefixValue, prefixName + ':')\n",
    "\n",
    "                queryResults[queryIndex][subQueryIndex] = (queryResultRaw[subQueryIndex][0], queryResult)\n",
    "\n",
    "        return queryResults\n",
    "    else: return queryResults\n",
    "\n",
    "\n",
    "def insertQuery(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    # Our local endpoint, the repo name is defined in `data/graphdb-repo.ttl` \n",
    "    sparql = SPARQLWrapper(\"http://localhost:7210/repositories/pgt/statements\") \n",
    "    sparql.setTimeout(300)\n",
    "    sparql.method = \"POST\"\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)    \n",
    "    sparql.queryType = \"INSERT\"\n",
    "    sparql.query()\n",
    "    return \"Inserted data successfully\"\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Check if everything works:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "number of query results =  3\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('s', 'rdf:type'), ('p', 'rdf:type'), ('o', 'rdf:Property')],\n",
       " [('s', 'rdfs:subPropertyOf'), ('p', 'rdf:type'), ('o', 'rdf:Property')],\n",
       " [('s', 'rdfs:subPropertyOf'),\n",
       "  ('p', 'rdf:type'),\n",
       "  ('o', 'owl:TransitiveProperty')]]"
      ]
     },
     "execution_count": 106,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Hello GraphDB\n",
    "query(\"\"\"\n",
    "select distinct * {\n",
    "    ?s ?p ?o\n",
    "}\n",
    "LIMIT 3\n",
    "\"\"\", replacePrefixes=True)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1 - Get tour sites in order\n",
    "\n",
    "We would like to retrieve every site touched by a specific tour, with name and coordinates.\n",
    "\n",
    "If you just follow a naive approach, this is what you get:\n",
    "\n",
    "```\n",
    "[[('stepIndex', 'rdf:_1'), ('site', 'pgt:SITE1')],\n",
    " [('stepIndex', 'rdf:_10'), ('site', 'pgt:SITE10')],\n",
    " [('stepIndex', 'rdf:_11'), ('site', 'pgt:SITE11')],\n",
    " [('stepIndex', 'rdf:_12'), ('site', 'pgt:SITE12')],\n",
    " [('stepIndex', 'rdf:_13'), ('site', 'pgt:SITE13')],\n",
    " [('stepIndex', 'rdf:_14'), ('site', 'pgt:SITE14')],\n",
    " [('stepIndex', 'rdf:_15'), ('site', 'pgt:SITE15')],\n",
    " [('stepIndex', 'rdf:_2'), ('site', 'pgt:SITE2')],\n",
    " [('stepIndex', 'rdf:_3'), ('site', 'pgt:SITE3')],\n",
    " [('stepIndex', 'rdf:_4'), ('site', 'pgt:SITE4')],\n",
    " [('stepIndex', 'rdf:_5'), ('site', 'pgt:SITE5')],\n",
    " [('stepIndex', 'rdf:_6'), ('site', 'pgt:SITE6')],\n",
    " [('stepIndex', 'rdf:_7'), ('site', 'pgt:SITE7')],\n",
    " [('stepIndex', 'rdf:_8'), ('site', 'pgt:SITE8')],\n",
    " [('stepIndex', 'rdf:_9'), ('site', 'pgt:SITE9')]]\n",
    " ```\n",
    "\n",
    " This happens because `rdf:_15` has a lower lexicographical order than `rdf:_2`. To get the right order, we need to strip the `rdf:` prefix and cast the result to integer.\n",
    "\n",
    " We do not have name/lat/long for every site, some information are missing. To account for that, we used the `OPTIONAL` keyword."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "number of query results =  15\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('stepIndexNumber', '1'),\n",
       "  ('siteName', 'Museo archeologico'),\n",
       "  ('siteLat', '45.41096111111111'),\n",
       "  ('siteLong', '11.880011111111111')],\n",
       " [('stepIndexNumber', '2'),\n",
       "  ('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('siteLat', '45.41096111111111'),\n",
       "  ('siteLong', '11.880011111111111')],\n",
       " [('stepIndexNumber', '3'),\n",
       "  ('siteName', 'Museo Bottacin'),\n",
       "  ('siteLat', '45.411569444444446'),\n",
       "  ('siteLong', '11.878119444444446')],\n",
       " [('stepIndexNumber', '4'),\n",
       "  ('siteName', \"Museo del Risorgimento e dell'Età Contemporanea\"),\n",
       "  ('siteLat', '45.40784722222222'),\n",
       "  ('siteLong', '11.876925')],\n",
       " [('stepIndexNumber', '5'),\n",
       "  ('siteName', 'Museo di anatomia patologica (Padova)'),\n",
       "  ('siteLat', '45.405027777777775'),\n",
       "  ('siteLong', '11.8859')],\n",
       " [('stepIndexNumber', '6'),\n",
       "  ('siteName', 'Centro di Ateneo per i Musei - CAM')],\n",
       " [('stepIndexNumber', '7'),\n",
       "  ('siteName', 'Collezione privata Safilo'),\n",
       "  ('siteLat', '45.414833333333334'),\n",
       "  ('siteLong', '11.928894444444444')],\n",
       " [('stepIndexNumber', '8'),\n",
       "  ('siteName', 'Esapolis'),\n",
       "  ('siteLat', '45.39771944444444'),\n",
       "  ('siteLong', '11.834161111111111')],\n",
       " [('stepIndexNumber', '9'),\n",
       "  ('siteName', 'Museo veneto del giocattolo'),\n",
       "  ('siteLat', '45.37021388888889'),\n",
       "  ('siteLong', '11.830047222222221')],\n",
       " [('stepIndexNumber', '10'),\n",
       "  ('siteName', 'Museo antoniano'),\n",
       "  ('siteLat', '45.40136111111111'),\n",
       "  ('siteLong', '11.880069444444445')],\n",
       " [('stepIndexNumber', '11'),\n",
       "  ('siteName', 'Museo del precinema'),\n",
       "  ('siteLat', '45.40001111111111'),\n",
       "  ('siteLong', '11.875761111111112')],\n",
       " [('stepIndexNumber', '12'),\n",
       "  ('siteName', \"Museo dell'Educazione\"),\n",
       "  ('siteLat', '45.40576111111111'),\n",
       "  ('siteLong', '11.873130555555557')],\n",
       " [('stepIndexNumber', '13'), ('siteName', 'Museo di Antropologia (Padova)')],\n",
       " [('stepIndexNumber', '14'),\n",
       "  ('siteName', \"Museo di geografia dell'Università di Padova\"),\n",
       "  ('siteLat', '45.40496944444444'),\n",
       "  ('siteLong', '11.879111111111111')],\n",
       " [('stepIndexNumber', '15'),\n",
       "  ('siteName', \"Museo di storia della fisica dell'Università di Padova\"),\n",
       "  ('siteLat', '45.41043055555556'),\n",
       "  ('siteLong', '11.88576111111111')]]"
      ]
     },
     "execution_count": 107,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "tourName = \"Tour 1\"\n",
    "query('''\n",
    "SELECT ?stepIndexNumber ?siteName ?siteLat ?siteLong WHERE {\n",
    "    ?tour a pgt:Tour;\n",
    "          sdo:name \"''' + tourName + '''\";\n",
    "\t      pgt:steps ?stepNode .\n",
    "    ?stepNode ?stepIndex ?site .\n",
    "\n",
    "    FILTER (strstarts(str(?stepIndex), 'http://www.w3.org/1999/02/22-rdf-syntax-ns#_'))\n",
    "\n",
    "    BIND (STRLEN(\"http://www.w3.org/1999/02/22-rdf-syntax-ns#_\") AS ?prefixLength)\n",
    "    BIND (xsd:integer(SUBSTR(xsd:string(?stepIndex),?prefixLength + 1)) AS ?stepIndexNumber).\n",
    "\n",
    "    OPTIONAL{ ?site sdo:name ?siteName. }\n",
    "    OPTIONAL{ ?site geo:lat  ?siteLat.  }\n",
    "    OPTIONAL{ ?site geo:long ?siteLong. }\n",
    "\n",
    "\n",
    "} ORDER BY ?stepIndexNumber\n",
    "\n",
    "''')\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2 - Check for missing information\n",
    "\n",
    "In the previous query, we noticed some data is missing from a bunch of cultural sites. What if we want to check for missing data or orphan nodes?\n",
    "\n",
    "We may do this via sparql, and use the `UNION` keyword to get all the errors at once."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "number of query results =  184\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('error', 'Missing geo data'), ('entity', 'pgt:SITE63')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE41')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE45')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE13')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE6')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITEsq3')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE105')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE106')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE108')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE110')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE112')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE114')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE116')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE117')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE119')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE133')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE134')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE135')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE136')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE137')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE138')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE139')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE145')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE22')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE23')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE25')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE26')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE27')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE31')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE34')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE37')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE50')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE59')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE64')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE65')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE69')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE82')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITE85')],\n",
       " [('error', 'Missing geo data'), ('entity', 'pgt:SITEsq1')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE63')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE41')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE43')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE45')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE47')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE10')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE11')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE12')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE13')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE14')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE15')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE5')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE6')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE7')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE8')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE9')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE100')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE101')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE102')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE103')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE104')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE105')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE106')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE107')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE108')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE109')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE110')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE111')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE112')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE113')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE114')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE115')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE116')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE117')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE118')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE119')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE120')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE121')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE122')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE123')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE124')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE125')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE126')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE127')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE128')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE129')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE130')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE131')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE132')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE133')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE134')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE135')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE136')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE137')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE138')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE139')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE140')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE141')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE142')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE143')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE144')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE145')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE146')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE147')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE148')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE149')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE16')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE17')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE18')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE19')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE20')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE21')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE22')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE23')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE24')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE25')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE26')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE27')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE28')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE29')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE30')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE31')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE32')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE33')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE34')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE35')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE36')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE37')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE38')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE39')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE40')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE42')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE44')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE46')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE48')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE49')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE50')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE51')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE52')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE53')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE54')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE55')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE56')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE57')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE58')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE59')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE60')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE61')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE62')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE64')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE65')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE66')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE67')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE68')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE69')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE70')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE71')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE72')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE73')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE74')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE75')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE76')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE77')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE78')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE79')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE80')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE81')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE82')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE83')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE84')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE85')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE86')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE87')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE88')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE89')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE90')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE91')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE92')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE93')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE94')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE95')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE96')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE97')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE98')],\n",
       " [('error', 'Missing CulturalSiteCategory'), ('entity', 'pgt:SITE99')]]"
      ]
     },
     "execution_count": 108,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query('''\n",
    "SELECT DISTINCT ?error ?entity WHERE {\n",
    "\n",
    "\n",
    "    { \n",
    "        SELECT ?error (?site AS ?entity)  WHERE { \n",
    "            BIND( \"Missing geo data\" as ?error)\n",
    "            ?site a pgt:CulturalSite .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?site geo:lat ?lat;\n",
    "                    geo:long ?long.\n",
    "            }\n",
    "        }\n",
    "    } UNION { \n",
    "        SELECT ?error (?site AS ?entity)  WHERE { \n",
    "            BIND( \"Missing CulturalSiteCategory\" as ?error)\n",
    "            ?site a pgt:CulturalSite .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?artwork pgt:hasSite ?site;\n",
    "            }\n",
    "        }\n",
    "    } UNION { \n",
    "        SELECT ?error (?artwork AS ?entity)  WHERE { \n",
    "            BIND( \"Missing CulturalSite\" as ?error)\n",
    "            ?artwork a pgt:Artwork .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?artwork pgt:hasSite ?site;\n",
    "            }\n",
    "        }\n",
    "    } \n",
    "\n",
    "\n",
    "}\n",
    "''')\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 3 - Get meaningful (with coordinates) sites by number of artworks\n",
    "\n",
    "Now we would like to create a new tour. In order to do so, we should see which sites have associated artwork and geo data, so we may pick meaningful sites.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "number of query results =  12\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('name', 'Palazzina del prefetto (ex)'), ('number', '804')],\n",
       " [('name', 'Convento degli Eremitani'), ('number', '752')],\n",
       " [('name', 'Complesso Cavalli'), ('number', '559')],\n",
       " [('name', 'Palazzo Folco'), ('number', '468')],\n",
       " [('name', \"Museo d'Arte Medievale e Moderna\"), ('number', '358')],\n",
       " [('name', 'Museo archeologico'), ('number', '279')],\n",
       " [('name', 'Palazzo ECA (ex)'), ('number', '179')],\n",
       " [('name', 'Cappella degli Scrovegni'), ('number', '68')],\n",
       " [('name', 'Museo Bottacin'), ('number', '28')],\n",
       " [('name', 'Palazzo Wollemborg'), ('number', '20')],\n",
       " [('name', 'Complesso Ingegneria'), ('number', '10')],\n",
       " [('name', \"Museo del Risorgimento e dell'Età Contemporanea\"),\n",
       "  ('number', '10')]]"
      ]
     },
     "execution_count": 109,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query(''' \n",
    "SELECT DISTINCT ?name (COUNT(?artwork) as ?number) WHERE { \n",
    "    ?artwork a pgt:Artwork; \n",
    "            pgt:hasSite ?site. \n",
    "    ?site sdo:name ?name. \n",
    "        FILTER EXISTS {?site geo:lat ?lat} \n",
    "        FILTER EXISTS {?site geo:long ?long} \n",
    " \n",
    "    }   \n",
    "GROUP BY ?name  \n",
    "ORDER BY DESC(?number) \n",
    "LIMIT 100 \n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "As you see, artworks are splitted across very few sites compared to the one we have, which are:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "number of query results =  1\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('numberOfCulturalSites', '159')]]"
      ]
     },
     "execution_count": 110,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query('''\n",
    "SELECT DISTINCT (COUNT(?site) as ?numberOfCulturalSites) WHERE {\n",
    "    ?site a pgt:CulturalSite;\n",
    "} LIMIT 1\n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This may be explained considering that:\n",
    "- many sites are not museums, but squared or other monuments\n",
    "- many sites do not provide data about their artworks"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 4 - Get sites by distance from a point\n",
    "\n",
    "We would also like to find sites near a certain point.\n",
    "\n",
    "First, we found a formula for computing the distance between two coordinates here <https://www.geeksforgeeks.org/program-distance-two-points-earth>. Then, we translated it in sparql using `ofn` functions provided by GraphDB <https://graphdb.ontotext.com/documentation/9.6/free/using-math-functions-with-sparql.html>.\n",
    "\n",
    "\n",
    "To test if everything is working, we start from a pair of well-known coordinates, so we can check the results on Google Maps afterwards:\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "distance calculated by hand on Google Maps: ~150m\n",
      "\n",
      "distance() python function:  162.42020990254528 m\n",
      "\n",
      "distance2() python function:  162.4202099022436 m\n",
      "\n",
      "sparql function: \n",
      "number of query results =  1\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('distance', '162.35992852325901')]]"
      ]
     },
     "execution_count": 111,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "lat1 = 45.41096111111111\n",
    "lat2 = 45.411569444444446\n",
    "lon1 = 11.880011111111111\n",
    "lon2 =  11.878119444444446\n",
    "\n",
    "\n",
    "\n",
    "from math import radians, cos, sin, asin, sqrt\n",
    "\n",
    "# Python 3 program to calculate Distance Between Two Points on Earth\n",
    "# taken from https://www.geeksforgeeks.org/program-distance-two-points-earth/\n",
    "# and adapted\n",
    "def distance(lat1, lat2, lon1, lon2):\n",
    "     \n",
    "    # The math module contains a function named\n",
    "    # radians which converts from degrees to radians.\n",
    "    lon1 = radians(lon1)\n",
    "    lon2 = radians(lon2)\n",
    "    lat1 = radians(lat1)\n",
    "    lat2 = radians(lat2)\n",
    "      \n",
    "    # Haversine formula\n",
    "    dlon = lon2 - lon1\n",
    "    dlat = lat2 - lat1\n",
    "    a = sin(dlat / 2)**2 + cos(lat1) * cos(lat2) * sin(dlon / 2)**2\n",
    " \n",
    "    c = 2 * asin(sqrt(a))\n",
    "    \n",
    "    # Radius of earth in kilometers = 6371. Use 3956 for miles\n",
    "    # Since we have small distances, I've changed it to meters\n",
    "    r = 6371 * 1000\n",
    "      \n",
    "    # calculate the result\n",
    "    return(c * r)\n",
    "\n",
    "\n",
    "# Simplified version of the function above\n",
    "def distance2(lat1, lat2, lon1, lon2):\n",
    "     \n",
    "    # The math module contains a function named\n",
    "    # radians which converts from degrees to radians.\n",
    "    lon1 = lon1 * 3.14159265359 / 180\n",
    "    lon2 = lon2 * 3.14159265359 / 180\n",
    "    lat1 = lat1 * 3.14159265359 / 180\n",
    "    lat2 = lat2 * 3.14159265359 / 180\n",
    "      \n",
    "\n",
    "    # Haversine formula\n",
    "    dlon = lon2 - lon1\n",
    "    dlat = lat2 - lat1\n",
    "\n",
    "    return 2 * asin(sqrt(sin(dlat / 2)**2 + cos(lat1) * cos(lat2) * sin(dlon / 2)**2)) * 6371 * 1000\n",
    " \n",
    "    \n",
    "    \n",
    "# we extract 2 pair of coordinates from query 1\n",
    "# if you insert them on google and use the \"measure distance tool\",\n",
    "# you get roughly 150m\n",
    "'''\n",
    " [('stepIndexNumber', '2'),\n",
    "  ('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
    "  ('siteLat', '45.41096111111111'),\n",
    "  ('siteLong', '11.880011111111111')],\n",
    " [('stepIndexNumber', '3'),\n",
    "  ('siteName', 'Museo Bottacin'),\n",
    "  ('siteLat', '45.411569444444446'),\n",
    "  ('siteLong', '11.878119444444446')],\n",
    "'''\n",
    "print(\"\\ndistance calculated by hand on Google Maps: ~150m\")\n",
    "print('\\ndistance() python function: ', distance(lat1, lat2, lon1, lon2), \"m\")\n",
    "print('\\ndistance2() python function: ',distance2(lat1, lat2, lon1, lon2), \"m\")\n",
    "\n",
    "\n",
    "print(\"\\nsparql function: \")\n",
    "# same function in sparql\n",
    "query('''\n",
    "SELECT DISTINCT ?distance {\n",
    "    BIND(\"''' + str(lat1) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lat1)\n",
    "    BIND(\"''' + str(lat2) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lat2)\n",
    "    BIND(\"''' + str(lon1) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lon1)\n",
    "    BIND(\"''' + str(lon2) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lon2)\n",
    "    BIND(?lat2 - ?lat1 AS ?dlat)\n",
    "    BIND(?lon2 - ?lon1 AS ?dlon)\n",
    "\n",
    "    BIND(2 * ofn:asin(ofn:sqrt(ofn:sin(?dlat / 2)* ofn:sin(?dlat / 2) + ofn:cos(?lat1) * ofn:cos(?lat2) * ofn:sin(?dlon / 2) * ofn:sin(?dlon / 2))) * 6371 * 1000 AS ?distance)\n",
    "\n",
    "}\n",
    "''')\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "As you see, we got closer results.\n",
    "\n",
    "Now we are ready for the actual query:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "number of query results =  105\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('siteName', 'Cappella degli Scrovegni'), ('distance', '46.1037033728453')],\n",
       " [('siteName', 'Museo archeologico'), ('distance', '67.59393234279999')],\n",
       " [('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('distance', '67.59393234279999')],\n",
       " [('siteName', 'Convento degli Eremitani'),\n",
       "  ('distance', '144.38608405467824')],\n",
       " [('siteName', 'Palazzo Zuckermann'), ('distance', '147.61968528552447')],\n",
       " [('siteName', 'Museo Bottacin'), ('distance', '147.61968528552447')],\n",
       " [('siteName', 'Complesso Cavalli'), ('distance', '157.8335972843654')],\n",
       " [('siteName', 'Palazzo Cavalli alle Porte Contarine'),\n",
       "  ('distance', '159.12098280757957')],\n",
       " [('siteName', 'Porte Contarine'), ('distance', '200.9640879391254')],\n",
       " [('siteName', 'Porta Altinate'), ('distance', '320.81427483311955')],\n",
       " [('siteName', 'Centro culturale Altinate/San Gaetano'),\n",
       "  ('distance', '345.47557984269116')],\n",
       " [('siteName', 'Chiesa di San Gaetano (Padova)'),\n",
       "  ('distance', '383.76138408772346')],\n",
       " [('siteName', 'Chiesa di San Fermo (Padova)'),\n",
       "  ('distance', '385.72263485422246')],\n",
       " [('siteName', \"Chiesa di Sant'Andrea (Padova)\"),\n",
       "  ('distance', '421.2074001837105')],\n",
       " [('siteName', \"Gatta di Sant'Andrea\"), ('distance', '435.1936794167633')],\n",
       " [('siteName', 'Scuola del Carmine'), ('distance', '462.63046530677985')],\n",
       " [('siteName', \"Museo di storia della fisica dell'Università di Padova\"),\n",
       "  ('distance', '466.3339553578984')],\n",
       " [('siteName', 'Caffè Pedrocchi'), ('distance', '474.76635923549196')],\n",
       " [('siteName', \"Museo del Risorgimento e dell'Età Contemporanea\"),\n",
       "  ('distance', '478.9320272987948')],\n",
       " [('siteName', 'Chiesa di Santa Lucia (Padova)'),\n",
       "  ('distance', '481.12863902491733')],\n",
       " [('siteName', 'Scuola di San Rocco (Padova)'),\n",
       "  ('distance', '483.36168000288666')],\n",
       " [('siteName', 'Ponte Molino'), ('distance', '488.9607692549007')],\n",
       " [('siteName', 'Porta Molino'), ('distance', '493.36086393807267')],\n",
       " [('siteName', 'Basilica del Carmine (Padova)'),\n",
       "  ('distance', '496.1177237374017')],\n",
       " [('siteName', 'Palazzo Folco'), ('distance', '538.9359074541471')],\n",
       " [('siteName', 'Tempio della Pace (Padova)'),\n",
       "  ('distance', '569.125508329447')],\n",
       " [('siteName', 'Palazzo del Bo'), ('distance', '576.121986835045')],\n",
       " [('siteName', 'Palazzo del Monte di Pietà Vecchio'),\n",
       "  ('distance', '579.5053123757905')],\n",
       " [('siteName', 'Palazzo Maldura'), ('distance', '585.8234772569133')],\n",
       " [('siteName', 'Palazzo Comunale (Padova)'),\n",
       "  ('distance', '586.3663700642029')],\n",
       " [('siteName', 'Chiesa di Santa Sofia (Padova)'),\n",
       "  ('distance', '603.2706140100445')],\n",
       " [('siteName', 'Palazzo della Ragione (Padova)'),\n",
       "  ('distance', '608.4922042248435')],\n",
       " [('siteName', 'Palazzo Zabarella'), ('distance', '623.6318232827416')],\n",
       " [('siteName', 'Ponte di San Lorenzo'), ('distance', '629.793676548392')],\n",
       " [('siteName', 'Chiesa di San Clemente (Padova)'),\n",
       "  ('distance', '634.5946703230164')],\n",
       " [('siteName', 'Chiesa di San Canziano (Padova)'),\n",
       "  ('distance', '646.5263948454124')],\n",
       " [('siteName', 'Palazzo delle Debite'), ('distance', '651.5718290762179')],\n",
       " [('siteName', 'Tomba di Antenore'), ('distance', '655.983666636137')],\n",
       " [('siteName', 'Chiesa di San Nicolò (Padova)'),\n",
       "  ('distance', '662.3878345241047')],\n",
       " [('siteName', 'Chiesa di Santa Margherita (Padova)'),\n",
       "  ('distance', '694.4221540228286')],\n",
       " [('siteName', 'MUSME'), ('distance', '702.2258131831054')],\n",
       " [('siteName', 'Ospedale di San Francesco Grande'),\n",
       "  ('distance', '702.2258131831054')],\n",
       " [('siteName', \"Torre dell'Orologio (Padova)\"),\n",
       "  ('distance', '704.8480489531662')],\n",
       " [('siteName', 'Mura di Padova'), ('distance', '705.5827857525393')],\n",
       " [('siteName', 'Chiesa del Beato Antonio Pellegrino'),\n",
       "  ('distance', '709.3486997652653')],\n",
       " [('siteName', 'Complesso Ingegneria'), ('distance', '710.1187026601551')],\n",
       " [('siteName', \"Chiesa di Sant'Eufemia (Padova)\"),\n",
       "  ('distance', '714.8771805011403')],\n",
       " [('siteName', 'Sinagoga di Padova di rito italiano'),\n",
       "  ('distance', '730.2332418671696')],\n",
       " [('siteName', \"Museo di geografia dell'Università di Padova\"),\n",
       "  ('distance', '737.3998509032723')],\n",
       " [('siteName', 'Palazzo Wollemborg'), ('distance', '743.5927892308702')],\n",
       " [('siteName', 'Chiesa di San Francesco Grande (Padova)'),\n",
       "  ('distance', '748.3085156278748')],\n",
       " [('siteName', 'Palazzo del Monte di Pietà Nuovo'),\n",
       "  ('distance', '769.1871478666558')],\n",
       " [('siteName', 'Sala dei Giganti (Padova)'), ('distance', '773.122520136015')],\n",
       " [('siteName', 'Palazzo Liviano'), ('distance', '789.8558249041774')],\n",
       " [('siteName', 'Museo diocesano (Padova)'), ('distance', '796.6991218779372')],\n",
       " [('siteName', 'Arco Valaresso'), ('distance', '804.6619376418193')],\n",
       " [('siteName', 'Loggia dei Carraresi'), ('distance', '825.6988726025962')],\n",
       " [('siteName', 'Battistero di Padova'), ('distance', '832.0115456317573')],\n",
       " [('siteName', 'Palazzo ECA (ex)'), ('distance', '837.2815827479159')],\n",
       " [('siteName', \"Museo dell'Educazione\"), ('distance', '840.0831394334747')],\n",
       " [('siteName', 'Chiesa di Santa Maria dei Servi (Padova)'),\n",
       "  ('distance', '842.0149334388736')],\n",
       " [('siteName', 'Museo di anatomia patologica (Padova)'),\n",
       "  ('distance', '860.6303912889346')],\n",
       " [('siteName', \"Chiesa dell'Immacolata (Padova)\"),\n",
       "  ('distance', '870.9190229122064')],\n",
       " [('siteName', 'Chiesa di Santa Caterina (Padova)'),\n",
       "  ('distance', '870.9742611815559')],\n",
       " [('siteName', 'Duomo di Padova'), ('distance', '905.7853435042784')],\n",
       " [('siteName', 'Chiesa di San Pietro Apostolo (Padova)'),\n",
       "  ('distance', '932.7082057505356')],\n",
       " [('siteName', \"Chiesa di Sant'Antonio di Vienna\"),\n",
       "  ('distance', '934.1767088169231')],\n",
       " [('siteName', 'Chiesa di San Benedetto Vecchio'),\n",
       "  ('distance', '1032.971000283856')],\n",
       " [('siteName', 'Loggia e Odeo Cornaro'), ('distance', '1052.5258846177153')],\n",
       " [('siteName', 'Chiesa di San Benedetto Novello'),\n",
       "  ('distance', '1056.542791243528')],\n",
       " [('siteName', 'Palazzo Mussato'), ('distance', '1060.6911998232968')],\n",
       " [('siteName', 'Palazzo Pisani de Lazzara'),\n",
       "  ('distance', '1061.880159905903')],\n",
       " [('siteName', 'Monumento equestre al Gattamelata'),\n",
       "  ('distance', '1132.2325997720432')],\n",
       " [('siteName', 'Museo antoniano'), ('distance', '1135.435478252382')],\n",
       " [('siteName', \"Basilica di Sant'Antonio di Padova\"),\n",
       "  ('distance', '1136.646422247902')],\n",
       " [('siteName', 'Oratorio di San Giorgio (Padova)'),\n",
       "  ('distance', '1167.4945388881779')],\n",
       " [('siteName', 'Palazzo Capodilista'), ('distance', '1181.58915862698')],\n",
       " [('siteName', 'Chiesa di San Massimo (Padova)'),\n",
       "  ('distance', '1186.1991701912905')],\n",
       " [('siteName', 'Porta Savonarola'), ('distance', '1192.9587820654192')],\n",
       " [('siteName', 'Chiesa di San Daniele (Padova)'),\n",
       "  ('distance', '1207.0088431809218')],\n",
       " [('siteName', \"Santuario dell'Arcella\"), ('distance', '1226.3172488829225')],\n",
       " [('siteName', 'Chiesa di San Tomaso Cantuariense (Padova)'),\n",
       "  ('distance', '1268.681993391505')],\n",
       " [('siteName', 'Chiesa di Santa Maria in Vanzo'),\n",
       "  ('distance', '1287.77459045358')],\n",
       " [('siteName', 'Castelvecchio (Padova)'), ('distance', '1303.8338871350618')],\n",
       " [('siteName', 'Chiesa di San Prosdocimo (Padova)'),\n",
       "  ('distance', '1303.919555210438')],\n",
       " [('siteName', 'Palazzo Angeli (Padova)'), ('distance', '1313.2538172832112')],\n",
       " [('siteName', 'Museo del precinema'), ('distance', '1327.2041203270603')],\n",
       " [('siteName', 'Palazzina del prefetto (ex)'),\n",
       "  ('distance', '1333.659938708827')],\n",
       " [('siteName', 'Chiesa di Ognissanti (Padova)'),\n",
       "  ('distance', '1376.683844914645')],\n",
       " [('siteName', 'Chiesa di Santa Maria del Torresino'),\n",
       "  ('distance', '1387.5482859342253')],\n",
       " [('siteName', 'Specola di Padova'), ('distance', '1393.7340841620553')],\n",
       " [('siteName', 'Oratorio di San Michele (Padova)'),\n",
       "  ('distance', '1420.9838042932233')],\n",
       " [('siteName', 'Porta San Giovanni (Padova)'),\n",
       "  ('distance', '1427.0171596723155')],\n",
       " [('siteName', 'Loggia Amulea'), ('distance', '1433.6225599027305')],\n",
       " [('siteName', 'Chiesa delle Dimesse'), ('distance', '1513.1936205188306')],\n",
       " [('siteName', 'Palazzo Grimani (Padova)'), ('distance', '1608.626629061492')],\n",
       " [('siteName', 'Chiesa di Santa Maria delle Grazie (Padova)'),\n",
       "  ('distance', '1617.019958945723')],\n",
       " [('siteName', 'Basilica di Santa Giustina'),\n",
       "  ('distance', '1688.4797073590457')],\n",
       " [('siteName', 'Muro di Padova'), ('distance', '1890.2772156094343')],\n",
       " [('siteName', 'Chiesa di San Carlo Borromeo (Padova)'),\n",
       "  ('distance', '2061.561117902353')],\n",
       " [('siteName', 'Scuola del Redentore'), ('distance', '2147.2318945766556')],\n",
       " [('siteName', 'Chiesa di Santa Croce (Padova)'),\n",
       "  ('distance', '2173.9432972461836')],\n",
       " [('siteName', 'Santuario di San Leopoldo Mandic'),\n",
       "  ('distance', '2212.66128926689')],\n",
       " [('siteName', 'Cimitero Maggiore (Padova)'),\n",
       "  ('distance', '2448.900146760721')],\n",
       " [('siteName', \"Tempio nazionale dell'internato ignoto\"),\n",
       "  ('distance', '2887.9788235602605')]]"
      ]
     },
     "execution_count": 112,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "lat = 45.411569444444446\n",
    "lon = 11.880011111111111\n",
    "maxDistance = 3000 # meters\n",
    "\n",
    "query('''\n",
    "SELECT DISTINCT ?siteName ?distance {\n",
    "    BIND(\"''' + str(lat) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lat1)\n",
    "    BIND(\"''' + str(lon) +'''\"^^xsd:float * 3.14159265359 / 180 as ?lon1)\n",
    "\n",
    "    ?site a pgt:CulturalSite .\n",
    "    ?site sdo:name ?siteName .\n",
    "\n",
    "    ?site geo:lat  ?lat2deg .\n",
    "    ?site geo:long ?lon2deg .\n",
    "\n",
    "\n",
    "    BIND(?lat2deg * 3.14159265359 / 180 as ?lat2)\n",
    "    BIND(?lon2deg * 3.14159265359 / 180 as ?lon2)\n",
    "    BIND(?lat2 - ?lat1 AS ?dlat)\n",
    "    BIND(?lon2 - ?lon1 AS ?dlon)\n",
    "\n",
    "    BIND(2 * ofn:asin(ofn:sqrt(ofn:sin(?dlat / 2)* ofn:sin(?dlat / 2) + ofn:cos(?lat1) * ofn:cos(?lat2) * ofn:sin(?dlon / 2) * ofn:sin(?dlon / 2))) * 6371 * 1000 AS ?distance)\n",
    "\n",
    "    FILTER(?distance < \"''' + str(maxDistance) + '''\"^^xsd:float).\n",
    "}ORDER BY ?distance LIMIT 1000\n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 5 - Get the tallest artwork made by each author"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "number of query results =  75\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('author', 'Manifattura brussellese, sec. XVI'), ('height', '440.0')],\n",
       " [('author', 'Girolamo da Romano detto Romanino'), ('height', '400.0')],\n",
       " [('author', 'Manifattura franco-fiamminga (1380-1385 circa)'),\n",
       "  ('height', '330.0')],\n",
       " [('author', 'Ludovico Gallina'), ('height', '276.0')],\n",
       " [('author', 'Antonio Canova'), ('height', '250.0')],\n",
       " [('author', 'Giambattista Piazzetta'), ('height', '234.0')],\n",
       " [('author', 'Alessandro Longhi'), ('height', '233.0')],\n",
       " [('author', 'Jacopo Negretti detto Palma il Giovane'), ('height', '232.0')],\n",
       " [('author', 'Tiberio Tinelli'), ('height', '226.0')],\n",
       " [('author', 'Giotto'), ('height', '223.0')],\n",
       " [('author', 'Giuseppe Zais'), ('height', '223.0')],\n",
       " [('author', 'Antonio Bonazza'), ('height', '220.0')],\n",
       " [('author', 'Giambettino Cignaroli'), ('height', '210.0')],\n",
       " [('author', 'Sebastiano Mazzoni'), ('height', '208.0')],\n",
       " [('author', 'Chiara Varotari'), ('height', '205.0')],\n",
       " [('author', 'Jacopo Robusti detto Tintoretto'), ('height', '202.0')],\n",
       " [('author', \"Giovanni De' Fondulis (e collaboratori)\"), ('height', '176.0')],\n",
       " [('author', 'Giambattista Tiepolo'), ('height', '171.0')],\n",
       " [('author', 'Francesco Segala'), ('height', '153.0')],\n",
       " [('author', 'Antonio Marini'), ('height', '150.0')],\n",
       " [('author', 'Pietro Della Vecchia'), ('height', '142.0')],\n",
       " [('author', 'Paolo Caliari detto Veronese'), ('height', '138.0')],\n",
       " [('author', 'Antonio Molinari'), ('height', '130.0')],\n",
       " [('author', 'Giorgio Fossati'), ('height', '120.0')],\n",
       " [('author', 'Guariento di Arpo'), ('height', '119.0')],\n",
       " [('author', 'Matteo Ghidoni detto Matteo dei Pitocchi'), ('height', '105.0')],\n",
       " [('author', 'Alessandro Varotari detto il Padovanino'), ('height', '102.0')],\n",
       " [('author', 'Francesco Aviani'), ('height', '98.0')],\n",
       " [('author', 'Johann Anton Eismann'), ('height', '96.0')],\n",
       " [('author', 'Marco Ricci'), ('height', '92.0')],\n",
       " [('author', 'Pietro Ricchi'), ('height', '92.0')],\n",
       " [('author', 'Giuseppe Borsato'), ('height', '88.0')],\n",
       " [('author', 'Giovanni Minello'), ('height', '84.0')],\n",
       " [('author', 'Giulio Carpioni'), ('height', '84.0')],\n",
       " [('author', 'Bartolomeo Pedon'), ('height', '82.0')],\n",
       " [('author', 'Guido Mazzoni'), ('height', '78.0')],\n",
       " [('author', 'Onofrio Gabrielli'), ('height', '76.0')],\n",
       " [('author', 'Alessandro Vittoria'), ('height', '74.0')],\n",
       " [('author', 'Antonio Diziani'), ('height', '74.0')],\n",
       " [('author', 'Andrea Briosco detto il Riccio'), ('height', '72.0')],\n",
       " [('author', 'Giovanni Bonazza'), ('height', '68.0')],\n",
       " [('author', 'Andrea Brustolon'), ('height', '66.0')],\n",
       " [('author', 'Andrea Previtali'), ('height', '63.0')],\n",
       " [('author', 'Pietro Longhi'), ('height', '63.0')],\n",
       " [('author', 'Rinaldino di Francia (attivo a Padova dal 1379 al 1401)'),\n",
       "  ('height', '60.0')],\n",
       " [('author', 'Giovanni Duknovich detto Dalmata'), ('height', '58.0')],\n",
       " [('author', 'Antonio Corradini'), ('height', '52.0')],\n",
       " [('author', 'Giuseppe Bernardino Bison'), ('height', '47.0')],\n",
       " [('author', 'Filippo Parodi'), ('height', '44.0')],\n",
       " [('author', 'Faustino Bocchi detto Bamboccio'), ('height', '43.0')],\n",
       " [('author', 'Rosalba Carriera'), ('height', '42.0')],\n",
       " [('author', 'Luigi Merlo'), ('height', '37.0')],\n",
       " [('author', 'Giovanni Bellini'), ('height', '35.0')],\n",
       " [('author', 'Tiziano Vecellio'), ('height', '35.0')],\n",
       " [('author', 'Orazio Marinali'), ('height', '33.0')],\n",
       " [('author', 'Giovanni Bonazza e bottega'), ('height', '29.0')],\n",
       " [('author',\n",
       "   'Manifattura Antonibon\\t\\t\\t\\t\\t\\t, bottega\\t\\t\\t\\t\\t\\t, attribuita'),\n",
       "  ('height', '28.0')],\n",
       " [('author', 'Intagliatore tedesco, sec. XVIII'), ('height', '24.0')],\n",
       " [('author', 'Intagliatore veneto, sec. XVII'), ('height', '23.0')],\n",
       " [('author', 'Anonimo ceramista'), ('height', '19.0')],\n",
       " [('author', 'Intagliatore veneto (?), sec. XVII'), ('height', '19.0')],\n",
       " [('author', 'Lavorante sconosciuto'), ('height', '18.0')],\n",
       " [('author', 'Giuseppe Brescaccini'), ('height', '17.0')],\n",
       " [('author', 'Bottega degli Embriachi (?)'), ('height', '16.0')],\n",
       " [('author', 'Giuseppe Rizzoli'), ('height', '16.0')],\n",
       " [('author', 'Vittorio Toso Borella'), ('height', '14.0')],\n",
       " [('author', 'Christoph Daniel Schenck'), ('height', '13.0')],\n",
       " [('author', 'Giorgio da Castelfranco detto Giorgione'), ('height', '12.0')],\n",
       " [('author', 'François Sorrieu (attivo a Parigi prima metà sec. XIX)'),\n",
       "  ('height', '10.0')],\n",
       " [('author', 'Intagliatore francese, sec. XIV'), ('height', '10.0')],\n",
       " [('author', 'Domenico Guidobono (bottega)\\t\\t\\t\\t\\t\\t, bottega'),\n",
       "  ('height', '6.0')],\n",
       " [('author', 'Antonio Rizzoli'), ('height', '5.0')],\n",
       " [('author', 'Pittore del bacile di Apollo\\t\\t\\t\\t\\t\\t, attr.'),\n",
       "  ('height', '5.0')],\n",
       " [('author', 'Pittore del Pianeta di Venere'), ('height', '4.0')],\n",
       " [('author', 'Apprendista sconosciuto'), ('height', '2.0')]]"
      ]
     },
     "execution_count": 113,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query(''' \n",
    "SELECT DISTINCT ?author ?artworkName ?height WHERE { \n",
    "    ?artwork a pgt:Artwork; \n",
    "             sdo:author ?author; \n",
    "             pgt:height ?height. \n",
    "    FILTER (?height=?maxHeight && ?author = ?Innerauthor) \n",
    "    { \n",
    " \n",
    "        SELECT ?Innerauthor (MAX(?height) AS ?maxHeight) WHERE { \n",
    "                ?artwork a pgt:Artwork; \n",
    "                        sdo:author ?Innerauthor;  \n",
    "                        pgt:height ?height. \n",
    "        }  \n",
    "        GROUP BY (?Innerauthor) \n",
    "    } \n",
    "} ORDER BY DESC(?height)\n",
    " \n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 6 - Generate a new tour\n",
    "\n",
    "This query will generate a tour given the name, description and visited sites (as a list of names of cultural sites).\n",
    "\n",
    "This is more a proof of concept than an actual useful query, since it would make way more sense to use a programming language to generate part of the query (for example, the UUID could be generated in Python instead) instead of a pure sparQL call.\n",
    "\n",
    "You may safely run this query multiple times: thanks to the `BIND` + `MINUS` keywords, the insertion is skipped if a tour with the same name already exists.\n",
    "\n",
    "*NOTE*: GraphDB requires a different endpoint for `INSERT` queries, thus we had to write a different function to handle inserts from the Notebook"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Inserted data successfully'"
      ]
     },
     "execution_count": 114,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "tourName = \"Generated Tour\"\n",
    "tourDescription = \"Description of generated tour\"\n",
    "\n",
    "# It would be nice to avoid manual index assigning of sites' indexes,\n",
    "# however, this is not possible, since sparQL lists are always unordered ones.\n",
    "\n",
    "tourSteps = '''\n",
    "    (1 \"Complesso Cavalli\")\n",
    "    (2 \"Palazzo Folco\")\n",
    "    (3 \"Museo d'Arte Medievale e Moderna\")\n",
    "'''\n",
    "\n",
    "insertQuery('''\n",
    "INSERT { \n",
    "    ?tourID a pgt:Tour.\n",
    "    ?tourStepsID a rdf:Seq.\n",
    "\n",
    "    ?tourID pgt:steps ?tourStepsID.\n",
    "    ?tourID sdo:name ?tourName.\n",
    "    ?tourID sdo:description ?tourDescription.\n",
    "    \n",
    "    ?tourStepsID ?isStep ?stepSite.\n",
    "\n",
    "} WHERE { \n",
    "    BIND(\"'''+ tourName + '''\" as ?tourName).\n",
    "    BIND(\"'''+ tourDescription + '''\" as ?tourDescription).\n",
    "    MINUS { \n",
    "        ?checkingTour a pgt:Tour;\n",
    "           sdo:name ?tourName.\n",
    "    }.\n",
    "    BIND(StrUUID() AS ?uuidCode) . \n",
    "    BIND(URI(CONCAT(\"https://padovagrandtour.github.io/entities#TOUR-\", ?uuidCode)) AS ?tourID).\n",
    "    BIND(URI(CONCAT(\"https://padovagrandtour.github.io/entities#TOURSTEPS-\", ?uuidCode)) AS ?tourStepsID).\n",
    "    \n",
    "    \n",
    "    VALUES (?stepIndex ?stepName) {'''\n",
    "        + tourSteps +\n",
    "    '''}\n",
    "    \n",
    "    BIND(URI(CONCAT(\"http://www.w3.org/1999/02/22-rdf-syntax-ns#_\", STR(?stepIndex))) AS ?isStep).\n",
    "    ?stepSite a pgt:CulturalSite;\n",
    "          sdo:name ?stepName.\n",
    "\n",
    "\n",
    "\n",
    "}\n",
    "\n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 7 - Get a tour preview\n",
    "\n",
    "Getting some random artworks of what we are going to see in the newly generated tour."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Tour\n",
      "number of query results =  10\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('artworkName',\n",
       "   \"Davide ordina a Joab ed all'esercito dei prodi di combattere contro gli Ammoniti\"),\n",
       "  ('artworkDescription',\n",
       "   \"L'arazzo aveva una funzione decorativa e pratica insieme: veniva appeso alle pareti per adornare chiese, castelli e palazzi, ma anche per schermare i muri gelidi e per suddividere gli spazi interni, trattenendo il calore del camino. \"),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/9527.jpg?itok=F4wCF7OH'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-arte-medievale-moderna/collezioni/dipinti/davide-ordina-joab-ed-esercito-prodi-combattere-contro-ammoniti')],\n",
       " [('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('artworkName', 'Paesaggio lacustre con edificio'),\n",
       "  ('artworkDescription',\n",
       "   \"Giuseppe Bernardino Bison rappresenta l’anello di congiunzione fra la tradizione settecentesca e il gusto neoclassico preromantico.  <br/>\\nIl Paesaggio lacustre con edificio è un tipico esempio della sua produzione. Si tratta di una tempera dall'atmosfera azzurrina: una vaga “fantasia” destinata alla decorazione di interni borghesi, dove il pittore originario di Palmanova traccia con veloce esecuzione un vasto panorama di vegetazione, montagne, acque e architetture. L’aspetto più evidente dei suoi paesaggi è costituito dalla luce, chiara e abbagliante, e dalla resa pittorica che è più ricca nei primi piani, mentre si fa sfumata e velata sullo sfondo.\"),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/6952.jpg?itok=tTHGcntD'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-arte-medievale-moderna/collezioni/dipinti/paesaggio-lacustre-edificio')],\n",
       " [('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('artworkName', 'Nano in trappola soccorso dai compagni'),\n",
       "  ('artworkDescription',\n",
       "   \"Nella tela alcuni nani tentano di liberare un compagno da un'enorme trappola mentre altri riveriscono un medico che giunge su una rudimentale portantina. Il pittore irride alla presuntuosa superiorità dell'arte medica e all'ingenua fiducia della gente. Dipinti come questo erano graditi dai nobili collezionisti che guardavano con curioso interesse e con distacco ai goffi e grotteschi soggetti rappresentati.   \"),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/8202.jpg?itok=C8irB8CR'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-arte-medievale-moderna/collezioni/dipinti/nano-trappola-soccorso-compagni')],\n",
       " [('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('artworkName', 'Adorazione dei pastori'),\n",
       "  ('artworkDescription',\n",
       "   'Il dipinto dell’illustre maestro veneziano è caratterizzato da variazioni luministiche rese con autentico virtuosismo. Si veda, ad esempio, l’effetto che la luce crea sulla testa calva del pastore inginocchiato ripreso di spalle. Così nella piccola tela il significato della forma si coglie tutto attraverso l’esperienza emozionale del lume notturno.<br/>\\nL’opera, destinata alla devozione privata, appartiene alle esperienze giovanili del pittore. Conferma la paternità di Giambattista Piazzetta l’esistenza di stampe incise da Francesco Bartolozzi nelle quali compare, identico, il gruppo di pastori raffigurato in questo dipinto.'),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/9353.jpg?itok=bD6F6KI4'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-arte-medievale-moderna/collezioni/dipinti/adorazione-pastori')],\n",
       " [('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('artworkName',\n",
       "   'Figura muliebre stante, verziere, mezze foglie accartocciate'),\n",
       "  ('artworkDescription',\n",
       "   'Cavo piano con brevissima parete distinta ed inclinata e orlo a tesa obliqua. Labbro tagliato. Fondo piano. Corpo ceramico compatto di colore arancio rosato scuro con schiarimento superficiale rivestito da ingobbio bianco e quasi completamente da vetrina incolore. Colori: giallo ferraccia e verde ramina.'),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/preview/144091.jpg?itok=LNptAdBY'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/http/padovamuseiit/musei/museo-arte-medievale-moderna/collezioni/ceramiche/figura-muliebre-stante-verziere-mezze-foglie-accartocciate')],\n",
       " [('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('artworkName', 'Merlettaia con la maestra'),\n",
       "  ('artworkDescription',\n",
       "   \"La scena rappresenta due personaggi femminili contrapposti nella tipologia e nel ruolo: la giovane merlettaia mentre esegue un pizzo a fuselli e l'anziana maestra che controlla il suo operato; accanto a lei sta un grosso gatto rivolto verso l'osservatore. Il taglio ravvicinato dell'immagine e l'onore del primo piano concesso al felino contribuiscono a dare immediatezza e spontaneità alla scena. Infine, l'incarnato luminoso e fresco e il rosso vivo delle maniche danno spicco alla figura della merlettaia. \"),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/143694.jpg?itok=4OXrEIco'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-arte-medievale-moderna/collezioni/dipinti/merlettaia-maestra')],\n",
       " [('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('artworkName', 'Fiore stilizzato a \"giardinetto\"'),\n",
       "  ('artworkDescription',\n",
       "   \"fascia liscia con parte superiore a sezione rettangolare, smeraldo e diamante ai lati; rubino, smeraldo e diamanti centrali, con piccolo gambo d'oro.\"),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/11978.jpg?itok=nhiQRMjR'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/http/padovamuseiit/musei/museo-arte-medievale-moderna/collezioni/gioielli/fiore-stilizzato-giardinetto')],\n",
       " [('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('artworkName', 'Busto di angelo a sei ali (Cherubino)'),\n",
       "  ('artworkDescription',\n",
       "   \"Questa tavola insieme alle altre 28 che il Museo conserva faceva parte della<br/>\\ndecorazione realizzata da Guariento per la cappella privata della Reggia Carrarese. Nel Settecento venne<br/>\\ndemolito il muro a oriente della cappella per ricavare la sala destinata alle adunanze dell’Accademia Patavina<br/>\\ndi Scienze, Lettere ed Arti (ora Galileiana). Nella sala rimangono oggi, oltre agli affreschi della parete<br/>\\noriginale, altri lacerti staccati già pertinenti a quella abbattuta. La decorazione venne eseguita probabilmente<br/>\\nentro il 1354, anno della visita del futuro imperatore Carlo IV, ospite dei Carraresi. <br/>\\nSecondo un'ipotesi (per molti aspetti credibile) la Madonna con il Bambino e gli Evangelisti ornavano il soffitto mentre le tavole con le Gerarchie angeliche erano inclinate e legate da una carpenteria gotica per creare un raccordo tra il soffitto e gli affreschi sottostanti.   \"),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/94979.jpg?itok=VxgE-Yyp'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-arte-medievale-moderna/collezioni/dipinti/busto-angelo-sei-ali-cherubino')],\n",
       " [('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('artworkName', 'Satiro seduto che beve'),\n",
       "  ('artworkDescription',\n",
       "   'Gli inventari del Museo ricordano una base andata perduta decorata da una sottile lamina a ovuli dorata. Il bronzetto presenta infatti tre fori che presumibilmente servivano per fissarlo al basamento: uno sul fondo e due in corrispondenza della parte alta delle zampe.'),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/14155.jpg?itok=x7lrYVHg'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/musei/museo-arte-medievale-moderna/collezioni/metalli-armi/satiro-seduto-che-beve')],\n",
       " [('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
       "  ('artworkName', 'Drago'),\n",
       "  ('artworkDescription',\n",
       "   \"ago liscio e inciso a spirale; drago alato d'oro lavorato a fusione, con corpo terminante a freccia, ali di diamanti e rubini e testa con occhi di rubino e diamante alla sommità. Una perla scaramazza a goccia fuoriesce dalle fauci.\"),\n",
       "  ('artworkImage',\n",
       "   'https://padovamusei.it/sites/default/files/styles/immagine_opera/public/opera/copertina/11666.jpg?itok=3sfDbyDR'),\n",
       "  ('artworkURL',\n",
       "   'https://padovamusei.it/it/http/padovamuseiit/musei/museo-arte-medievale-moderna/collezioni/gioielli/drago')]]"
      ]
     },
     "execution_count": 115,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "print(tourName)\n",
    "query(''' \n",
    "SELECT ?siteName ?artworkName ?artworkDescription ?artworkImage ?artworkURL WHERE { \n",
    "    ?tour a pgt:Tour; \n",
    "          sdo:name \"'''+ tourName + '''\"; \n",
    "       pgt:steps ?stepNode . \n",
    "           \n",
    "    ?stepNode ?stepIndex ?site . \n",
    "    FILTER (strstarts(str(?stepIndex), 'http://www.w3.org/1999/02/22-rdf-syntax-ns#_')) \n",
    " \n",
    " \n",
    "    ?site sdo:name ?siteName . \n",
    " \n",
    "    ?artwork pgt:hasSite ?site; \n",
    "             sdo:image ?artworkImage; \n",
    "             sdo:name ?artworkName; \n",
    "             sdo:url ?artworkURL; \n",
    "             sdo:description ?artworkDescription. \n",
    " \n",
    "} ORDER BY RAND() LIMIT 10 \n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 8 - Get tour recap/metrics\n",
    "\n",
    "In this query we get some metrics about the whole tour, such as the total travelled distance and the average year of the artwork we are going to see.\n",
    "\n",
    "\n",
    "**Total travelled distance:** here the strategy is to generate the distance between all the possible pair of steps, and then filter and sum just the ones where ((step1 - step2) == 1).\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 116,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total distance:  1003.8607374587223\n"
     ]
    }
   ],
   "source": [
    "# First, we compute \"by hand\" the distance, so we may check if the result is right later.\n",
    "# These are cultural sites touched by the generated tour:\n",
    "'''\n",
    "[[('stepIndexNumber', '1'),\n",
    "  ('siteName', 'Complesso Cavalli'),\n",
    "  ('siteLat', '45.412362'),\n",
    "  ('siteLong', '11.878333')],\n",
    " [('stepIndexNumber', '2'),\n",
    "  ('siteName', 'Palazzo Folco'),\n",
    "  ('siteLat', '45.4089272'),\n",
    "  ('siteLong', '11.8742248')],\n",
    " [('stepIndexNumber', '3'),\n",
    "  ('siteName', \"Museo d'Arte Medievale e Moderna\"),\n",
    "  ('siteLat', '45.41096111111111'),\n",
    "  ('siteLong', '11.880011111111111')]]\n",
    "\n",
    "'''\n",
    "# And this is the total travelled distance from 1 to 2 + from 2 to 3:\n",
    "print(\"Total distance: \", distance2(45.412362, 45.4089272, 11.878333, 11.8742248) + distance2(45.4089272, 45.41096111111111, 11.8742248, 11.880011111111111))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Average artworks year:** at first, we were using `xds:year`. This type, however, does not play nice with the AVG operator and even with a cast we were getting weird results. We found the type is not suited to represent every year, but is meant to represent just 4-digit dates d.C. Switching to `xsd:int` in the ontology solved the problem.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "number of query results =  1325\n",
      "Average year:  669.9275471698129\n"
     ]
    }
   ],
   "source": [
    "# First, we compute \"by hand\" the average, so we may check if the result is right later.\n",
    "\n",
    "artworksWithYear = query('''\n",
    "    SELECT ?year ?yearText ?artworkY  WHERE {\n",
    "        ?tour a pgt:Tour;\n",
    "        sdo:name \"''' + tourName + '''\";\n",
    "        pgt:steps ?stepNode .\n",
    "\n",
    "        BIND (STRLEN(\"http://www.w3.org/1999/02/22-rdf-syntax-ns#_\") AS ?prefixLength)\n",
    "\n",
    "\n",
    "        ?stepNode ?stepIndexY ?siteY .\n",
    "        FILTER (strstarts(str(?stepIndexY), 'http://www.w3.org/1999/02/22-rdf-syntax-ns#_'))\n",
    "        \n",
    "        ?artworkY pgt:hasSite ?siteY ;\n",
    "                pgt:yearCreatedText ?yearText;\n",
    "                pgt:yearCreated ?year.\n",
    "\n",
    "    }\n",
    "\n",
    "\n",
    "''')\n",
    "\n",
    "\n",
    "accum = 0\n",
    "for artwork in artworksWithYear:\n",
    "    [(_,year),(_, yearText),(_, artw)] = artwork\n",
    "    accum = accum + (float(year)/len(artworksWithYear))\n",
    "    if(float(year) > 2000): print(year,yearText, artw)\n",
    "    \n",
    "print(\"Average year calculated in python: \", accum)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Final query:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 118,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Tour\n",
      "number of query results =  2\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('totalDistance', '1004.0919189086599')],\n",
       " [('avgYear', '669.927547169811320754716981')]]"
      ]
     },
     "execution_count": 118,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "print(tourName)\n",
    "query('''\n",
    "SELECT ?totalDistance ?avgYear WHERE {\n",
    "    {\n",
    "        SELECT  (SUM(?distance) as ?totalDistance) WHERE {\n",
    "            ?tour a pgt:Tour;\n",
    "            sdo:name \"''' + tourName + '''\";\n",
    "            pgt:steps ?stepNode .\n",
    "\n",
    "            BIND (STRLEN(\"http://www.w3.org/1999/02/22-rdf-syntax-ns#_\") AS ?prefixLength)\n",
    "\n",
    "\n",
    "            ?stepNode ?stepIndex1 ?startPoint .\n",
    "            FILTER (strstarts(str(?stepIndex1), 'http://www.w3.org/1999/02/22-rdf-syntax-ns#_'))\n",
    "            BIND (xsd:integer(SUBSTR(xsd:string(?stepIndex1),?prefixLength + 1)) AS ?stepIndexNumber1).\n",
    "\n",
    "            ?stepNode ?stepIndex2 ?endPoint .\n",
    "            FILTER (strstarts(str(?stepIndex2), 'http://www.w3.org/1999/02/22-rdf-syntax-ns#_'))\n",
    "            BIND (xsd:integer(SUBSTR(xsd:string(?stepIndex2),?prefixLength + 1)) AS ?stepIndexNumber2).\n",
    "\n",
    "            ?startPoint a pgt:CulturalSite ;\n",
    "                    geo:lat  ?lat1deg ;\n",
    "                    geo:long  ?lon1deg .\n",
    "\n",
    "            ?endPoint   a pgt:CulturalSite ; \n",
    "                    geo:lat  ?lat2deg ;\n",
    "                    geo:long  ?lon2deg .\n",
    "\n",
    "            BIND(?lat1deg * 3.14159265359 / 180 as ?lat1)\n",
    "            BIND(?lon1deg * 3.14159265359 / 180 as ?lon1)\n",
    "            BIND(?lat2deg * 3.14159265359 / 180 as ?lat2)\n",
    "            BIND(?lon2deg * 3.14159265359 / 180 as ?lon2)\n",
    "            BIND(?lat2 - ?lat1 AS ?dlat)\n",
    "            BIND(?lon2 - ?lon1 AS ?dlon)\n",
    "\n",
    "            BIND(2 * ofn:asin(ofn:sqrt(ofn:sin(?dlat / 2)* ofn:sin(?dlat / 2) + ofn:cos(?lat1) * ofn:cos(?lat2) * ofn:sin(?dlon / 2) * ofn:sin(?dlon / 2))) * 6371 * 1000 AS ?distance)\n",
    "            FILTER((?stepIndexNumber2 - ?stepIndexNumber1) = 1)\n",
    "\n",
    "        }\n",
    "    } UNION {\n",
    "        SELECT (AVG(?year) as ?avgYear) WHERE {\n",
    "            ?tour a pgt:Tour;\n",
    "            sdo:name \"''' + tourName + '''\";\n",
    "            pgt:steps ?stepNode .\n",
    "\n",
    "            BIND (STRLEN(\"http://www.w3.org/1999/02/22-rdf-syntax-ns#_\") AS ?prefixLength)\n",
    "\n",
    "\n",
    "            ?stepNode ?stepIndexY ?siteY .\n",
    "            FILTER (strstarts(str(?stepIndexY), 'http://www.w3.org/1999/02/22-rdf-syntax-ns#_'))\n",
    "            \n",
    "            ?artworkY pgt:hasSite ?siteY ;\n",
    "                    pgt:yearCreated ?year.\n",
    "\n",
    "        }\n",
    "    }\n",
    "\n",
    "\n",
    "    \n",
    "}\n",
    "''') "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 9 - Get cultural sites which have more than 50 artworks in poor state, displaying these artworks names"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 119,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "number of query results =  1\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('site', 'pgt:SITE1'),\n",
       "  ('artwork_count', '95'),\n",
       "  ('artwork_names',\n",
       "   \"Kouros, Guerriero in assalto, Guerriero in assalto, Kore, Ercole in assalto, Guerriero in assalto, Ercole in assalto, Ercole in assalto, Kore, Ercole in assalto, Kore, Ercole in assalto, Guerriero a cavallo, Orante, Ercole in assalto, Cavaliere, Orante, Apollo con patera, Cavaliere, Viaggio agli Inferi, Scena di commiato, Uccelli su albero, Fannii, Bollo CARTORIAN, Ratto di Ganimede, Bollo CARTORIAN, Motivi geometrici e fitomorfi, Sileno, Venere che si toglie il sandalo, Iscrizione di Marco Arrunzio Aquila, Atto evergetico di Allenius Strabo, Statua femminile acefala, Giove tonante, Mercurio, Iscrizione di Tilonia Musice, Iscrizione, Iscrizione Rutilius Regillus e Lucius Porcius Germanus, Iscrizione di C. Arrius Optatus, A scorrimento con testa ad anello, Iscrizione, Iscrizione di Quinto Satrio Severo, Iscritta, Bollo CLAVD PANSI, Ritratto femminile, Due busti e un bambino, Iscrizione di Q. Pomponius Severus, Ritratto femminile, Augusto, Livia, Iscrizione Q. Valerius C.f. Silo, Ritratto maschile, Piede umano destro, Busto maschile, Iscrizione beneagurante, Tito Iestino Augurino, Purricina e Iuvenis, Tipo a scorrimento con impugnatura, Bilancia pesa monete, Iscrizione di Gaio Asconio Sardo, Ritratto maschile, A cruna singola, Asclepio (?), Tubolare, a corpo quasi cilindrico, Iscrizione di C. Cluentius Proculus, Asclepio, Uomo seduto e giovinetto stante, Scena di banchetto, Figura femminile nell'atto di incedere, Cavaliere, Scena di sacrificio, Fanciullo che tiene un oggetto tra le mani, Tre menadi danzanti, Tre menadi danzanti, Scena di sacrificio, Hermes, Dioniso, Fauno, Pan, Dioniso e satiro, Testa femminile, Doroteo e Nice, Due Cupidi in lotta, Guerriero, Cavallino, Venere, Mercurio, Offerente con diadema, Offerente armato, Devoto offerente con testa coronata, Kouros, Devoto offerente con testa coronata, Venere pudica, Kouros, Kouros offerente, Figura umana\")]]"
      ]
     },
     "execution_count": 119,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query('''  \n",
    "    SELECT ?site (COUNT(?artwork) AS ?artwork_count)   \n",
    "    (GROUP_CONCAT(?artwork_name; SEPARATOR=\", \") AS ?artwork_names)  \n",
    "  \n",
    "    WHERE {  \n",
    "      ?site a pgt:CulturalSite .  \n",
    "      ?artwork pgt:hasSite ?site.  \n",
    "      ?artwork sdo:name ?artwork_name.  \n",
    "      ?artwork pgt:conservationState \"Mutilo\"^^xsd:string .  \n",
    "    }   \n",
    "    GROUP BY (?site) HAVING( ?artwork_count > 50 )  \n",
    "    ORDER BY DESC (?artwork_count)  \n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 10 -Authors that painted the biggest paintings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 120,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "number of query results =  10\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('author', 'Jacopo Negretti detto Palma il Giovane'),\n",
       "  ('paintingName',\n",
       "   'Dipinto celebrativo dei rettori Jacopo e Giovanni Soranzo'),\n",
       "  ('surface', '128760.0')],\n",
       " [('author', 'Girolamo da Romano detto Romanino'),\n",
       "  ('paintingName',\n",
       "   'Madonna con il Bambino e i santi Benedetto, Giustina, Prosdocimo e Scolastica\\ncimasa: Pietà\\ntondi: san Luca, san Mattia, san Massimo e san Giuliano da Padova e tre santi martiri innocenti'),\n",
       "  ('surface', '104800.0')],\n",
       " [('author', 'Giambattista Tiepolo'),\n",
       "  ('paintingName', \"San Patrizio vescovo d'Irlanda\"),\n",
       "  ('surface', '56088.0')],\n",
       " [('author', 'Giambattista Piazzetta'),\n",
       "  ('paintingName', 'Cena in Emmaus'),\n",
       "  ('surface', '55692.0')],\n",
       " [('author', 'Jacopo Robusti detto Tintoretto'),\n",
       "  ('paintingName', 'Crocifissione'),\n",
       "  ('surface', '53530.0')],\n",
       " [('author', 'Ludovico Gallina'),\n",
       "  ('paintingName', 'Ritratto del doge Paolo Renier'),\n",
       "  ('surface', '45264.0')],\n",
       " [('author', 'Giotto'), ('paintingName', 'Croce'), ('surface', '36572.0')],\n",
       " [('author', 'Giambettino Cignaroli'),\n",
       "  ('paintingName', 'Ritratto di Giovanni Bragadin, patriarca di Venezia'),\n",
       "  ('surface', '32340.0')],\n",
       " [('author', 'Alessandro Longhi'),\n",
       "  ('paintingName',\n",
       "   'Ritratto di Antonio Renier, provveditore generale in Dalmazia e Albania'),\n",
       "  ('surface', '31921.0')],\n",
       " [('author', 'Sebastiano Mazzoni'),\n",
       "  ('paintingName', 'Ritratto di capitano veneziano'),\n",
       "  ('surface', '27872.0')]]"
      ]
     },
     "execution_count": 120,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query(''' \n",
    "SELECT ?author ?paintingName (?height*?width as ?surface) \n",
    "WHERE { \n",
    "    ?artwork a pgt:Artwork; \n",
    "            sdo:author ?author; \n",
    "            sdo:name ?paintingName; \n",
    "            pgt:tag ?tag; \n",
    "            pgt:height ?height; \n",
    "            pgt:width ?width. \n",
    "    FILTER(REGEX(?tag,\"dipinto\")) \n",
    "} \n",
    "ORDER BY DESC(?surface) \n",
    "LIMIT 10 \n",
    "''')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.6 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.6"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "916dbcbb3f70747c44a77c7bcd40155683ae19c65e1c03b4aa3499c5328201f1"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
