{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"https://dati.cultura.gov.it/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            array.append(app)\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The operation failed EndPointInternalError: The endpoint returned the HTTP status code 500. \n",
      "\n",
      "Response:\n",
      "b'Virtuoso S1T00 Error SR171: Transaction timed out\\n\\nSPARQL query:\\n\\n##-d47addd645-##\\nPREFIX wd: <http://www.wikidata.org/entity/> \\nPREFIX wdt: <http://www.wikidata.org/prop/direct/> \\nPREFIX sc: <http://schema.org/>\\n\\n\\nselect distinct * where {\\n  ?s ?p ?o\\n  FILTER regex(?s, \"Padova\")\\n}\\nLIMIT 600\\n'\n"
     ]
    },
    {
     "ename": "TypeError",
     "evalue": "object of type 'NoneType' has no len()",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mTypeError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m/tmp/ipykernel_8735/2562682581.py\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m      7\u001b[0m \"\"\")\n\u001b[1;32m      8\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 9\u001b[0;31m \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mlen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0ma\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     10\u001b[0m \u001b[0ma\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mTypeError\u001b[0m: object of type 'NoneType' has no len()"
     ]
    }
   ],
   "source": [
    "a = run_query(\"\"\"\n",
    "select distinct * where {\n",
    "  ?s ?p ?o\n",
    "  FILTER regex(?s, \"Padova\")\n",
    "}\n",
    "LIMIT 600\n",
    "\"\"\")\n",
    "\n",
    "print(len(a))\n",
    "a\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "100\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/City/Spilimbergo')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/fontaniva')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/vergato')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/san-genesio-ed-uniti')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/tovo-di-santagata')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/cernusco-sul-naviglio')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/albano-laziale')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/azzano-dasti')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/castegnero')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/rocchetta-tanaro')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/san-giorgio-di-piano')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/santa-giustina-in-colle')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/tavullia')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/vinchio')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/fratte-rosa')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/santagata-feltria')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/appignano-del-tronto')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/castelnovo-bariano')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/san-zeno-di-montagna')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/polcenigo')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/cerreto-guidi')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/fagnano-castello')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/lula')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/poggio-sannita')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/samugheo')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/sarule')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/mandello-del-lario')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/bagnolo-san-vito')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/brunello')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/casalzuigno')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/castellanza')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/gavirate')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/san-giovanni-valdarno')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/solbiate-arno')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/sumirago')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/vimodrone')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/abbadia-lariana')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/cardano-al-campo')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/casorate-sempione')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/gorla-minore')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/borgoforte')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/cantello')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/daverio')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/fiera-di-primiero')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/gagnago')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/ostia-antica')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/roccaromana')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/san-gregorio-matese')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/santarpino')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/sparanise')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/torre-del-greco')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/villa-literno')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/apice')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/arpaise')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/baia-e-latina')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/capodrise')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/castel-volturno')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/castelvetere-in-val-fortore')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/cellole')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/cerreto-sannita')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/colle-sannita')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/foiano-di-val-fortore')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/fontegreca')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/monte-santa-maria-tiberina')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/orta-di-atella')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/paduli')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/pannarano')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/pontelatone')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/san-cipriano-daversa')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/san-giorgio-la-molara')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/san-nazario')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/san-nicola-manfredi')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/san-prisco')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/santa-maria-la-fossa')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/sassinoro')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/scheggia-e-pascelupo')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/teverola')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/tora-e-piccilli')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/castelnuovo-parano')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/cassola')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/dervio')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/margno')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/solignano')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/valmozzola')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/pradalunga')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/agropoli')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/aiello-del-sabato')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/aquara')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/buccino')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/buonabitacolo')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/cairano')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/candida')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/cannalonga')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/casalbuono')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/cassano-irpino')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/castellabate')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/castelnuovo-di-conza')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/chianche')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/controne')],\n",
       " [('s', 'https://w3id.org/arco/resource/City/contursi-terme')]]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "a = run_query(\"\"\"\n",
    "select distinct * where {\n",
    "  ?s rdf:type <https://w3id.org/italia/onto/CLV/City>\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\")\n",
    "\n",
    "print(len(a))\n",
    "a"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('s', 'http://dati.beniculturali.it/mibact/luoghi/resource/City/Padova')],\n",
       " [('s', 'http://dati.beniculturali.it/mibact/eventi/resource/City/Padova')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/eventi/resource/City/Masera_di_Padova')]]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "a = run_query(\"\"\"\n",
    "select distinct * where {\n",
    "  ?s a <https://w3id.org/italia/onto/CLV/City>\n",
    "  FILTER regex(?s, \"Padova\")\n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\")\n",
    "\n",
    "print(len(a))\n",
    "a"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "21\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('s', 'https://w3id.org/arco/resource/City/padova'),\n",
       "  ('p', 'http://www.w3.org/2002/07/owl#sameAs')],\n",
       " [('s', 'http://dati.beniculturali.it/mibact/eventi/resource/City/Padova'),\n",
       "  ('p', 'http://www.w3.org/2002/07/owl#sameAs')],\n",
       " [('s', 'http://dati.beniculturali.it/icar/san/resource/City/padova'),\n",
       "  ('p', 'http://www.w3.org/2002/07/owl#sameAs')],\n",
       " [('s', 'http://dati.beniculturali.it/iccd/fotografico/resource/City/padova'),\n",
       "  ('p', 'http://www.w3.org/2002/07/owl#sameAs')],\n",
       " [('s', 'http://dati.beniculturali.it/iccu/anagrafe/resource/City/028060'),\n",
       "  ('p', 'http://www.w3.org/2002/07/owl#sameAs')],\n",
       " [('s', 'http://dati.beniculturali.it/iccd/schede/resource/City/PADOVA'),\n",
       "  ('p', 'http://www.w3.org/2002/07/owl#sameAs')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Archivio_di_Stato_di_Padova_126366'),\n",
       "  ('p', 'https://w3id.org/italia/onto/CLV/hasCity')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Biblioteca_Statale_del_Monumento_Nazionale_di_Santa_Giustina_118201'),\n",
       "  ('p', 'https://w3id.org/italia/onto/CLV/hasCity')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Biblioteca_Universitaria_di_Padova_116763'),\n",
       "  ('p', 'https://w3id.org/italia/onto/CLV/hasCity')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Cappella_degli_Scrovegni_100940'),\n",
       "  ('p', 'https://w3id.org/italia/onto/CLV/hasCity')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Dipartimento_Scienze_Medico_Diagnostiche_e_Terapie_Speciali_100915'),\n",
       "  ('p', 'https://w3id.org/italia/onto/CLV/hasCity')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Loggia_e_Odeo_Cornaro_100935'),\n",
       "  ('p', 'https://w3id.org/italia/onto/CLV/hasCity')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Musei_civici_di_Padova_100918'),\n",
       "  ('p', 'https://w3id.org/italia/onto/CLV/hasCity')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Museo_Vincenzo_Stefano_Breda_105475'),\n",
       "  ('p', 'https://w3id.org/italia/onto/CLV/hasCity')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Museo_veneto_del_giocattolo_-_onlus_100933'),\n",
       "  ('p', 'https://w3id.org/italia/onto/CLV/hasCity')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Oratorio_San_Rocco_100936'),\n",
       "  ('p', 'https://w3id.org/italia/onto/CLV/hasCity')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Palazzo_Zuckermann_100934'),\n",
       "  ('p', 'https://w3id.org/italia/onto/CLV/hasCity')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Piano_nobile_dello_stabilimento_Pedrocchi_100922'),\n",
       "  ('p', 'https://w3id.org/italia/onto/CLV/hasCity')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Centro_di_Ateneo_-_Orto_botanico_dell_Universita_di_Padova_100912'),\n",
       "  ('p', 'https://w3id.org/italia/onto/CLV/hasCity')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Palazzo_Cavalli_143572'),\n",
       "  ('p', 'https://w3id.org/italia/onto/CLV/hasCity')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Museo_diocesano_di_Padova_100930'),\n",
       "  ('p', 'https://w3id.org/italia/onto/CLV/hasCity')]]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "a = run_query(\"\"\"\n",
    "select distinct * where {\n",
    "  ?s ?p <http://dati.beniculturali.it/mibact/luoghi/resource/City/Padova>\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\")\n",
    "\n",
    "print(len(a))\n",
    "a"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "15\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Archivio_di_Stato_di_Padova_126366')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Biblioteca_Statale_del_Monumento_Nazionale_di_Santa_Giustina_118201')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Biblioteca_Universitaria_di_Padova_116763')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Cappella_degli_Scrovegni_100940')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Dipartimento_Scienze_Medico_Diagnostiche_e_Terapie_Speciali_100915')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Loggia_e_Odeo_Cornaro_100935')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Musei_civici_di_Padova_100918')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Museo_Vincenzo_Stefano_Breda_105475')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Museo_veneto_del_giocattolo_-_onlus_100933')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Oratorio_San_Rocco_100936')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Palazzo_Zuckermann_100934')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Piano_nobile_dello_stabilimento_Pedrocchi_100922')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Centro_di_Ateneo_-_Orto_botanico_dell_Universita_di_Padova_100912')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Palazzo_Cavalli_143572')],\n",
       " [('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Museo_diocesano_di_Padova_100930')]]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "a = run_query(\"\"\"\n",
    "select distinct * where {\n",
    "  ?s <https://w3id.org/italia/onto/CLV/hasCity> <http://dati.beniculturali.it/mibact/luoghi/resource/City/Padova>\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\")\n",
    "\n",
    "print(len(a))\n",
    "a"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "9\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type'),\n",
       "  ('o', 'https://w3id.org/italia/onto/CLV/Address')],\n",
       " [('p', 'http://www.w3.org/2000/01/rdf-schema#label'),\n",
       "  ('o', 'Indirizzo della Sede di: Palazzo Zuckermann')],\n",
       " [('p', 'https://w3id.org/italia/onto/CLV/hasProvince'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Province/Padova')],\n",
       " [('p', 'https://w3id.org/italia/onto/CLV/hasRegion'),\n",
       "  ('o', 'http://dati.beniculturali.it/mibact/luoghi/resource/Region/Veneto')],\n",
       " [('p', 'https://w3id.org/italia/onto/CLV/fullAddress'),\n",
       "  ('o', 'Corso Garibaldi - Padova')],\n",
       " [('p', 'https://w3id.org/italia/onto/CLV/hasCountry'),\n",
       "  ('o', 'http://dati.beniculturali.it/mibact/luoghi/resource/Country/Italia')],\n",
       " [('p', 'https://w3id.org/italia/onto/CLV/postCode'), ('o', '35126')],\n",
       " [('p', 'https://w3id.org/italia/onto/CLV/hasCity'),\n",
       "  ('o', 'http://dati.beniculturali.it/mibact/luoghi/resource/City/Padova')],\n",
       " [('p', 'https://w3id.org/italia/onto/CLV/hasStreetToponym'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/StreetToponym/100934')]]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "a = run_query(\"\"\"\n",
    "select distinct * where {\n",
    "    <http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Palazzo_Zuckermann_100934> ?p ?o\n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\")\n",
    "\n",
    "print(len(a))\n",
    "a"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('s',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Site/Sede_di_100934'),\n",
       "  ('p', 'http://dati.beniculturali.it/cis/siteAddress')]]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "a = run_query(\"\"\"\n",
    "select distinct * where {\n",
    "    ?s ?p <http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Palazzo_Zuckermann_100934>\n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\")\n",
    "\n",
    "print(len(a))\n",
    "a"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type'),\n",
       "  ('o', 'http://dati.beniculturali.it/cis/Site')],\n",
       " [('p', 'http://www.w3.org/2000/01/rdf-schema#label'),\n",
       "  ('o', 'Sede di Palazzo Zuckermann')],\n",
       " [('p', 'http://dati.beniculturali.it/cis/siteAddress'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Palazzo_Zuckermann_100934')],\n",
       " [('p', 'https://w3id.org/italia/onto/CLV/hasGeometry'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Geometry/Coordinate_geografiche_della_sede_di_Palazzo_Zuckermann_100934')],\n",
       " [('p', 'https://w3id.org/italia/onto/l0/name'),\n",
       "  ('o', 'Sede di Palazzo Zuckermann')]]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "a = run_query(\"\"\"\n",
    "select distinct ?p ?o where {\n",
    "    ?s ?pp <http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Palazzo_Zuckermann_100934>.\n",
    "    ?s ?p ?o\n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\")\n",
    "\n",
    "print(len(a))\n",
    "a"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('ss',\n",
       "   'http://dati.beniculturali.it/mibact/eventi/resource/Site/Sede_di_3717'),\n",
       "  ('p', 'http://www.w3.org/2002/07/owl#sameAs')],\n",
       " [('ss',\n",
       "   'http://dati.beniculturali.it/mibact/eventi/resource/Site/Sede_di_5624'),\n",
       "  ('p', 'http://www.w3.org/2002/07/owl#sameAs')],\n",
       " [('ss',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/CulturalInstituteOrSite/100930'),\n",
       "  ('p', 'http://dati.beniculturali.it/cis/hasSite')]]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "a = run_query(\"\"\"\n",
    "select distinct ?ss ?p ?o where {\n",
    "    ?s ?pp <http://dati.beniculturali.it/mibact/luoghi/resource/Address/Indirizzo_della_sede_di_Museo_diocesano_di_Padova_100930>.\n",
    "    ?ss ?p ?s\n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\")\n",
    "\n",
    "print(len(a))\n",
    "a"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "17\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type'),\n",
       "  ('o', 'http://dati.beniculturali.it/cis/CulturalInstituteOrSite')],\n",
       " [('p', 'http://www.w3.org/2000/01/rdf-schema#label'),\n",
       "  ('o', 'Museo diocesano di Padova')],\n",
       " [('p', 'http://www.w3.org/2002/07/owl#sameAs'),\n",
       "  ('o', 'http://www.wikidata.org/entity/Q3868332')],\n",
       " [('p', 'http://dati.beniculturali.it/cis/hasSite'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Site/Sede_di_100930')],\n",
       " [('p', 'http://dati.beniculturali.it/cis/hasDiscipline'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/SubjectDiscipline/Sito_Default')],\n",
       " [('p', 'http://www.w3.org/2003/01/geo/wgs84_pos#lat'), ('o', '45.40653')],\n",
       " [('p', 'http://www.w3.org/2003/01/geo/wgs84_pos#long'), ('o', '11.872349')],\n",
       " [('p', 'http://xmlns.com/foaf/0.1/depiction'),\n",
       "  ('o',\n",
       "   'http://media.beniculturali.it/mibac/files/boards/388a5474724a15af0ace7a40ab3301de/Veneto/Padova/Padova,%20Museo%20diocesano.jpg')],\n",
       " [('p', 'http://purl.org/dc/elements/1.1/type'),\n",
       "  ('o', 'Museo, Galleria e/o raccolta')],\n",
       " [('p', 'https://w3id.org/italia/onto/CLV/hasGeometry'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Geometry/Coordinate_geografiche_della_sede_di_Museo_diocesano_di_Padova_100930')],\n",
       " [('p', 'https://w3id.org/italia/onto/l0/identifier'),\n",
       "  ('o', 'DBUnico.100930')],\n",
       " [('p', 'http://dati.beniculturali.it/cis/hasCISNameInTime'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/CISNameInTime/100930')],\n",
       " [('p', 'http://dati.beniculturali.it/cis/institutionalCISName'),\n",
       "  ('o', 'Museo diocesano di Padova')],\n",
       " [('p', 'https://w3id.org/italia/onto/AccessCondition/hasAccessCondition'),\n",
       "  ('o', 'http://dati.beniculturali.it/mibact/luoghi/resource/Booking/None')],\n",
       " [('p', 'https://w3id.org/italia/onto/AccessCondition/hasAccessCondition'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/OpeningHoursSpecification/Chiusura_100930')],\n",
       " [('p', 'https://w3id.org/italia/onto/SM/hasOnlineContactPoint'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/OnlineContactPoint/http___www_museodiocesanopadova_it-info_museodiocesanopadova_it-049652855')],\n",
       " [('p', 'https://w3id.org/italia/onto/l0/description'),\n",
       "  ('o',\n",
       "   \"l Museo diocesano di Padova è un museo, inaugurato nel 2000, allestito negli ambienti del Palazzo vescovile di Padova, costruito nel XV secolo, ma la cui fondazione risale agli inizi del XIV secolo. L'edificio sorge a fianco del duomo cittadino in piazza Duomo, nel centro storico del capoluogo veneto.\")]]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "a = run_query(\"\"\"\n",
    "select distinct * where {\n",
    "    <http://dati.beniculturali.it/mibact/luoghi/resource/CulturalInstituteOrSite/100930> ?p ?o\n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\")\n",
    "\n",
    "print(len(a))\n",
    "a"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "18\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type'),\n",
       "  ('o', 'http://dati.beniculturali.it/cis/CulturalInstituteOrSite')],\n",
       " [('p', 'http://www.w3.org/2000/01/rdf-schema#label'),\n",
       "  ('o', 'Cappella degli Scrovegni')],\n",
       " [('p', 'http://www.w3.org/2002/07/owl#sameAs'),\n",
       "  ('o', 'http://www.wikidata.org/entity/Q963954')],\n",
       " [('p', 'http://www.w3.org/2002/07/owl#sameAs'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/iccd/schede/resource/CulturalInstituteOrSite/S011785_Cappella_degli_Scrovegni')],\n",
       " [('p', 'http://dati.beniculturali.it/cis/hasSite'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Site/Sede_di_100940')],\n",
       " [('p', 'http://dati.beniculturali.it/cis/hasDiscipline'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/SubjectDiscipline/Sito_Default')],\n",
       " [('p', 'http://www.w3.org/2003/01/geo/wgs84_pos#lat'), ('o', '45.411667')],\n",
       " [('p', 'http://www.w3.org/2003/01/geo/wgs84_pos#long'), ('o', '11.879128')],\n",
       " [('p', 'http://xmlns.com/foaf/0.1/depiction'),\n",
       "  ('o',\n",
       "   'http://media.beniculturali.it/mibac/files/boards/388a5474724a15af0ace7a40ab3301de/Veneto/Padova/Padova,%20Cappella%20degli%20Scrovegni.jpg')],\n",
       " [('p', 'http://purl.org/dc/elements/1.1/type'),\n",
       "  ('o', 'Museo, Galleria e/o raccolta')],\n",
       " [('p', 'https://w3id.org/italia/onto/CLV/hasGeometry'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/Geometry/Coordinate_geografiche_della_sede_di_Cappella_degli_Scrovegni_100940')],\n",
       " [('p', 'https://w3id.org/italia/onto/l0/identifier'),\n",
       "  ('o', 'DBUnico.100940')],\n",
       " [('p', 'http://dati.beniculturali.it/cis/hasCISNameInTime'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/CISNameInTime/100940')],\n",
       " [('p', 'http://dati.beniculturali.it/cis/institutionalCISName'),\n",
       "  ('o', 'Cappella degli Scrovegni')],\n",
       " [('p', 'https://w3id.org/italia/onto/AccessCondition/hasAccessCondition'),\n",
       "  ('o', 'http://dati.beniculturali.it/mibact/luoghi/resource/Booking/None')],\n",
       " [('p', 'https://w3id.org/italia/onto/AccessCondition/hasAccessCondition'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/OpeningHoursSpecification/Chiusura_100940')],\n",
       " [('p', 'https://w3id.org/italia/onto/SM/hasOnlineContactPoint'),\n",
       "  ('o',\n",
       "   'http://dati.beniculturali.it/mibact/luoghi/resource/OnlineContactPoint/http___www_cappelladegliscrovegni_it-0498204551')],\n",
       " [('p', 'https://w3id.org/italia/onto/l0/description'),\n",
       "  ('o',\n",
       "   \"\\n\\tLa piccola chiesa di forme semplici e pulite esternamente presenta all'interno un unico ambiente, terminante sul fondo con un presbiterio in cui si trova il sarcofago di Enrico Scrovegni, opera di Andriolo de Santi e sull'altare una Madonna col bimbo, opera dello scultore trecentesco Giovanni Pisano. La cappella è costituita da un unico vano di 20,5 x 8,5 m. e di 18,5 m. in altezza con copertura a botte. L'interno venne affrescato da Giotto con le vicende dei genitori di Maria, Gioacchino e Anna, con le Storie della Vergine e di Gesù, e in controfacciata con il Giudizio Universale narrato nell'Apocalisse. Inoltre vengono realizzate quattordici allegorie a monocromo dei Vizi e delle Virtù nell'alto zoccolo perimetrale. L'intera decorazione è considerata uno dei massimi capolavori dell'arte di tutti i tempi.\")]]"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "a = run_query(\"\"\"\n",
    "select distinct * where {\n",
    "    <http://dati.beniculturali.it/mibact/luoghi/resource/CulturalInstituteOrSite/100940> ?p ?o\n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\")\n",
    "\n",
    "print(len(a))\n",
    "a"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "100\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050784'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050785'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050786'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050787'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050789'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050790'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050791'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050792'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050794'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050796'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050799'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050801'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050824'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050826'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050829'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050855'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050883'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050886'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050925'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050941'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050942'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050958'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500050996'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051050'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051057'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051089'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051090'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051122'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051123'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051126'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051135'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051136'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051137'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051138'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051142'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051144'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051145'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051152'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051154'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051169'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051170'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051172'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051174'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051183'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051195'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051196'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051197'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051209'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051211'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051213'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051215'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051216'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051245'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051253'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051255'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051271'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051274'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051278'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051280'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051292'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051307'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051309'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051310'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051333'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051344'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051355'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051356'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051379'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051380'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051387'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051390'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051401'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051410'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051415'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051419'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051422'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051423'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051424'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051426'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051429'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051436'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051442'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051443'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051446'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051447'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051449'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051461'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051467'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051471'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051474'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051487'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051496'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051504'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051512'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051517'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051519'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051522'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051524'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051527'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')],\n",
       " [('s', 'https://w3id.org/arco/resource/CatalogueRecordOA/1500051532'),\n",
       "  ('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type')]]"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "a = run_query(\"\"\"\n",
    "select distinct * where {\n",
    "    ?s ?p <https://w3id.org/arco/ontology/catalogue/CatalogueRecordOA>\n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\")\n",
    "\n",
    "print(len(a))\n",
    "a"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "100\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[('s',\n",
       "   'https://w3id.org/arco/resource/Address/659862aed7f9a072bfc013e39c636ed8')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/d9abfcafe1f47611378cde6c8a73c00a')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/936e739d64d91390165f539ae086edf4')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/960b507f611299a2422a41bab9afd5a1')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/019d8672ea662b83c444f3ed02888e03')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/5f8afa609721f1805ee287a2916a7d73')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/61df0611897908c5f5cd3e14bfb62d21')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/64a81fe8b550973d2300ea0b1770219b')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/7147d1a6010dbdb18414637ff2c1570d')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/e1de27c97d45cf02ea3e342b3ebd43fa')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/f26a5b51e8be638019b1dae79ad1d013')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/a410c8a4df19ae05b6a2a276be1092cd')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/a500bd51706a711f755eaf0ab669a870')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/db7dff83b9b0fed8660bf0739ce510d6')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/758f5811d8c3801bfd3fe4f6a88f5f1f')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/a164adc420eb358940ce42e92399770c')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/dfd8677ec05ff40eafe656a06782d16e')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/4f9302b03359877de0bdd15f0690776a')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/03ae40b55fb110122c3786493616113d')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/5b5016ef886a732ffef2f08b7a482f66')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/7ded0cddb27f0215f070c1b6eb6fbd1a')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/b127182a4132c9ece35b499427b043e2')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/069aeca015089bcf59a0c5d57a56c176')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/23a43b01bab51cb2e6fd10f741bff598')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/6ccc49cfc4428f15fcced605888632c4')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/6d651df3dd699ae342857fcc1841489c')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/774bada413f942e16997c2d619f0da3d')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/c05eecc2547a2fbe50ebc32838edd982')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/64b96fbdb8b8b764d4c552a31da9854a')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/b49b434ecbbd120ac8f60e1e0eb14871')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/022df35af4f8357d24a74ed07b0efe21')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/196bd4e58f5a532e7bebf3c7726e8f23')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/bdf5c3057f50d1034745e255593460ff')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/58379bb1f25e55cc6dea5320e781b1bd')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/867a01a1ece2f59de387386a50eab7ba')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/fa8d9ab84f901113945d77ad35d5a370')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/5c445659b098853a8b61ac2cf261a258')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/5d92382d61d9ed5071090932747db056')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/66b9631554191b15f7176b65ee0a673b')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/6fdd4bfb2509ca6ae71ca1039da08a05')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/723db87dc7d1f417285bc6f36af88f49')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/72a72653fe1f551eb582f76a767a2c10')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/983cd2afcddc85dad36e847761475926')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/bd137be9649db4a9107ca23609e15d33')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/d399b41def7a260dc32d911cda43083a')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/abaf5df082e46b070f94982c6e3d83fc')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/1635f05d25f31dba4329446e2b653b80')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/2ea8378ffd156919c5429debcff27353')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/f1ea7b3f104021e52302ec7b52f0dbce')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/40dcb3a40ea3f1f1ed11a7340b7b4ea5')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/1eb65022374aa75a9e19d0dd02579365')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/aae2ea31c80e91c6d8fc26eb506c4db2')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/55a7d5e84594c43d798f6f4c27f18fe5')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/3d30634b0ea504db58bd27c7860a3621')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/b5d07042d5d0f4bd830de06b141b4aac')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/cf1022aacb387d42ed03e8bf650ea395')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/910143f3adb8e9c97b70dfd9796962ab')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/62b3506ba66eb97daeee8d23f97960d6')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/73fa75c0fc465beaa7eb4241978bc970')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/03dc99741a09819b948e8cd55a02ddf7')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/0a19d45d4e0f8d2758e37c671fbe35ae')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/27470e07d6ddb86ef1e1289b5a2e0ccb')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/3412981069e5b61687258fba820f86b9')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/3b662b144f251fca79a1873fe5dc3f2b')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/3b7af8be5a948bf30782c9276cf64cf2')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/548b65cef61d75286ff2b0354ada8288')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/5767637c128d0f2053b13e0aec22cd6e')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/5768954ec45c5ca9c5a671a162e2f2f8')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/5d225dca160e0ac08067c2d63da4d34f')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/63b57d8810ce90309629d602d6b38e62')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/64e5277283b1bb0a2439f422fed0675e')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/7bcc7d09e9d257fdc401bd2485dcda3b')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/826dfc4747162984cab3d593b88972e3')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/95177256981ae1d68053849f1caa3308')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/9572d34f9ea80b0680ef79e94fd3cd8e')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/98e4b90f326bcb158e7b6e6c29359204')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/9ecbe59821a6539895905d12933362f5')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/9f441718799b34cf6c6f1bb54610d31c')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/ab9fa2bf0bf6ea63b3954f38a138a9c7')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/b38c51a7203441ba64d4aebe9bdf9168')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/d84115dd74ccfb9a7d19b1a3a1a9b712')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/dd86ee37e719d83f918860d2b9cc05c7')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/e9d621574a2f4441b5586217f71401eb')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/f6f51d6cfeac599c166d946c24c21953')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/f8e65db54556c8284fd2ccd5cc030fa4')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/65e9e25bfba834aae9a9399322872a77')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/be9b33b259006c8d7218d1021b814db9')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/4092ad0c9b5dd556d0ec23a8cfa2ee23')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/60f47e66f720fd9d9c807ad0d762a6f9')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/8aca144007f215b712b5edb7f426ad9d')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/d57abdcf97a3a2b416fc2d84a7f10ca1')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/0aa10fc5a88b61ab0187f97e791647ed')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/0d964c3996e994b81ce9ac89ca0ac972')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/15b8414a25fce23eadc6026953776ec0')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/15ce5a2be15fef13e034bd0f5b807d89')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/182970f6e178f6ac2b8ea8a1c86aa285')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/1a18d0974b188cffe8be9ab9ac2ca041')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/2e372e7e860487acda988a2d10d681a3')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/3f0ba1c35ffcc9acb79dc36fe961c5fd')],\n",
       " [('s',\n",
       "   'https://w3id.org/arco/resource/Address/4af59d80d2c722e4f3a380ba0c5d8f7a')]]"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "a = run_query(\"\"\"\n",
    "select distinct * where {\n",
    "  ?s  <https://w3id.org/italia/onto/CLV/hasCity> <https://w3id.org/arco/resource/City/padova>\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\")\n",
    "\n",
    "print(len(a))\n",
    "a"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.6 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.6"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "916dbcbb3f70747c44a77c7bcd40155683ae19c65e1c03b4aa3499c5328201f1"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
